grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
#pragma once 

/* --- GMAC: Gigabit Ethernet MAC ----------------------------------- */

/** @defgroup gmac_registers Gigabit Ethernet MAC Register
@{*/

/** GMAC_GMAC_NCR Network Control Register **/
#define GMAC_GMAC_NCR			MMIO32(GMAC_BASE + 0x00)
/** GMAC_GMAC_NCFGR Network Configuration Register **/
#define GMAC_GMAC_NCFGR			MMIO32(GMAC_BASE + 0x04)
/** GMAC_GMAC_NSR Network Status Register **/
#define GMAC_GMAC_NSR			MMIO32(GMAC_BASE + 0x08)
/** GMAC_GMAC_UR User Register **/
#define GMAC_GMAC_UR			MMIO32(GMAC_BASE + 0x0c)
/** GMAC_GMAC_DCFGR DMA Configuration Register **/
#define GMAC_GMAC_DCFGR			MMIO32(GMAC_BASE + 0x10)
/** GMAC_GMAC_TSR Transmit Status Register **/
#define GMAC_GMAC_TSR			MMIO32(GMAC_BASE + 0x14)
/** GMAC_GMAC_RBQB Receive Buffer Queue Base Address Register **/
#define GMAC_GMAC_RBQB			MMIO32(GMAC_BASE + 0x18)
/** GMAC_GMAC_TBQB Transmit Buffer Queue Base Address Register **/
#define GMAC_GMAC_TBQB			MMIO32(GMAC_BASE + 0x1c)
/** GMAC_GMAC_RSR Receive Status Register **/
#define GMAC_GMAC_RSR			MMIO32(GMAC_BASE + 0x20)
/** GMAC_GMAC_ISR Interrupt Status Register **/
#define GMAC_GMAC_ISR			MMIO32(GMAC_BASE + 0x24)
/** GMAC_GMAC_IER Interrupt Enable Register **/
#define GMAC_GMAC_IER			MMIO32(GMAC_BASE + 0x28)
/** GMAC_GMAC_IDR Interrupt Disable Register **/
#define GMAC_GMAC_IDR			MMIO32(GMAC_BASE + 0x2c)
/** GMAC_GMAC_IMR Interrupt Mask Register **/
#define GMAC_GMAC_IMR			MMIO32(GMAC_BASE + 0x30)
/** GMAC_GMAC_MAN PHY Maintenance Register **/
#define GMAC_GMAC_MAN			MMIO32(GMAC_BASE + 0x34)
/** GMAC_GMAC_RPQ Received Pause Quantum Register **/
#define GMAC_GMAC_RPQ			MMIO32(GMAC_BASE + 0x38)
/** GMAC_GMAC_TPQ Transmit Pause Quantum Register **/
#define GMAC_GMAC_TPQ			MMIO32(GMAC_BASE + 0x3c)
/** GMAC_GMAC_TPSF TX Partial Store and Forward Register **/
#define GMAC_GMAC_TPSF			MMIO32(GMAC_BASE + 0x40)
/** GMAC_GMAC_RPSF RX Partial Store and Forward Register **/
#define GMAC_GMAC_RPSF			MMIO32(GMAC_BASE + 0x44)
/** GMAC_GMAC_RJFML RX Jumbo Frame Max Length Register **/
#define GMAC_GMAC_RJFML			MMIO32(GMAC_BASE + 0x48)
/** GMAC_GMAC_HRB Hash Register Bottom **/
#define GMAC_GMAC_HRB			MMIO32(GMAC_BASE + 0x80)
/** GMAC_GMAC_HRT Hash Register Top **/
#define GMAC_GMAC_HRT			MMIO32(GMAC_BASE + 0x84)
/** GMAC_GMAC_SA0_GMAC_SAB Specific Address 1 Bottom Register **/
#define GMAC_GMAC_SA0_GMAC_SAB			MMIO32(GMAC_BASE + 0x88)
/** GMAC_GMAC_SA0_GMAC_SAT Specific Address 1 Top Register **/
#define GMAC_GMAC_SA0_GMAC_SAT			MMIO32(GMAC_BASE + 0x8c)
/** GMAC_GMAC_SA1_GMAC_SAB Specific Address 1 Bottom Register **/
#define GMAC_GMAC_SA1_GMAC_SAB			MMIO32(GMAC_BASE + 0x90)
/** GMAC_GMAC_SA1_GMAC_SAT Specific Address 1 Top Register **/
#define GMAC_GMAC_SA1_GMAC_SAT			MMIO32(GMAC_BASE + 0x94)
/** GMAC_GMAC_SA2_GMAC_SAB Specific Address 1 Bottom Register **/
#define GMAC_GMAC_SA2_GMAC_SAB			MMIO32(GMAC_BASE + 0x98)
/** GMAC_GMAC_SA2_GMAC_SAT Specific Address 1 Top Register **/
#define GMAC_GMAC_SA2_GMAC_SAT			MMIO32(GMAC_BASE + 0x9c)
/** GMAC_GMAC_SA3_GMAC_SAB Specific Address 1 Bottom Register **/
#define GMAC_GMAC_SA3_GMAC_SAB			MMIO32(GMAC_BASE + 0xa0)
/** GMAC_GMAC_SA3_GMAC_SAT Specific Address 1 Top Register **/
#define GMAC_GMAC_SA3_GMAC_SAT			MMIO32(GMAC_BASE + 0xa4)
/** GMAC_GMAC_TIDM1 Type ID Match 1 Register **/
#define GMAC_GMAC_TIDM1			MMIO32(GMAC_BASE + 0xa8)
/** GMAC_GMAC_TIDM2 Type ID Match 2 Register **/
#define GMAC_GMAC_TIDM2			MMIO32(GMAC_BASE + 0xac)
/** GMAC_GMAC_TIDM3 Type ID Match 3 Register **/
#define GMAC_GMAC_TIDM3			MMIO32(GMAC_BASE + 0xb0)
/** GMAC_GMAC_TIDM4 Type ID Match 4 Register **/
#define GMAC_GMAC_TIDM4			MMIO32(GMAC_BASE + 0xb4)
/** GMAC_GMAC_WOL Wake on LAN Register **/
#define GMAC_GMAC_WOL			MMIO32(GMAC_BASE + 0xb8)
/** GMAC_GMAC_IPGS IPG Stretch Register **/
#define GMAC_GMAC_IPGS			MMIO32(GMAC_BASE + 0xbc)
/** GMAC_GMAC_SVLAN Stacked VLAN Register **/
#define GMAC_GMAC_SVLAN			MMIO32(GMAC_BASE + 0xc0)
/** GMAC_GMAC_TPFCP Transmit PFC Pause Register **/
#define GMAC_GMAC_TPFCP			MMIO32(GMAC_BASE + 0xc4)
/** GMAC_GMAC_SAMB1 Specific Address 1 Mask Bottom Register **/
#define GMAC_GMAC_SAMB1			MMIO32(GMAC_BASE + 0xc8)
/** GMAC_GMAC_SAMT1 Specific Address 1 Mask Top Register **/
#define GMAC_GMAC_SAMT1			MMIO32(GMAC_BASE + 0xcc)
/** GMAC_GMAC_NSC 1588 Timer Nanosecond Comparison Register **/
#define GMAC_GMAC_NSC			MMIO32(GMAC_BASE + 0xdc)
/** GMAC_GMAC_SCL 1588 Timer Second Comparison Low Register **/
#define GMAC_GMAC_SCL			MMIO32(GMAC_BASE + 0xe0)
/** GMAC_GMAC_SCH 1588 Timer Second Comparison High Register **/
#define GMAC_GMAC_SCH			MMIO32(GMAC_BASE + 0xe4)
/** GMAC_GMAC_EFTSH PTP Event Frame Transmitted Seconds High Register **/
#define GMAC_GMAC_EFTSH			MMIO32(GMAC_BASE + 0xe8)
/** GMAC_GMAC_EFRSH PTP Event Frame Received Seconds High Register **/
#define GMAC_GMAC_EFRSH			MMIO32(GMAC_BASE + 0xec)
/** GMAC_GMAC_PEFTSH PTP Peer Event Frame Transmitted Seconds High Register **/
#define GMAC_GMAC_PEFTSH			MMIO32(GMAC_BASE + 0xf0)
/** GMAC_GMAC_PEFRSH PTP Peer Event Frame Received Seconds High Register **/
#define GMAC_GMAC_PEFRSH			MMIO32(GMAC_BASE + 0xf4)
/** GMAC_GMAC_OTLO Octets Transmitted Low Register **/
#define GMAC_GMAC_OTLO			MMIO32(GMAC_BASE + 0x100)
/** GMAC_GMAC_OTHI Octets Transmitted High Register **/
#define GMAC_GMAC_OTHI			MMIO32(GMAC_BASE + 0x104)
/** GMAC_GMAC_FT Frames Transmitted Register **/
#define GMAC_GMAC_FT			MMIO32(GMAC_BASE + 0x108)
/** GMAC_GMAC_BCFT Broadcast Frames Transmitted Register **/
#define GMAC_GMAC_BCFT			MMIO32(GMAC_BASE + 0x10c)
/** GMAC_GMAC_MFT Multicast Frames Transmitted Register **/
#define GMAC_GMAC_MFT			MMIO32(GMAC_BASE + 0x110)
/** GMAC_GMAC_PFT Pause Frames Transmitted Register **/
#define GMAC_GMAC_PFT			MMIO32(GMAC_BASE + 0x114)
/** GMAC_GMAC_BFT64 64 Byte Frames Transmitted Register **/
#define GMAC_GMAC_BFT64			MMIO32(GMAC_BASE + 0x118)
/** GMAC_GMAC_TBFT127 65 to 127 Byte Frames Transmitted Register **/
#define GMAC_GMAC_TBFT127			MMIO32(GMAC_BASE + 0x11c)
/** GMAC_GMAC_TBFT255 128 to 255 Byte Frames Transmitted Register **/
#define GMAC_GMAC_TBFT255			MMIO32(GMAC_BASE + 0x120)
/** GMAC_GMAC_TBFT511 256 to 511 Byte Frames Transmitted Register **/
#define GMAC_GMAC_TBFT511			MMIO32(GMAC_BASE + 0x124)
/** GMAC_GMAC_TBFT1023 512 to 1023 Byte Frames Transmitted Register **/
#define GMAC_GMAC_TBFT1023			MMIO32(GMAC_BASE + 0x128)
/** GMAC_GMAC_TBFT1518 1024 to 1518 Byte Frames Transmitted Register **/
#define GMAC_GMAC_TBFT1518			MMIO32(GMAC_BASE + 0x12c)
/** GMAC_GMAC_GTBFT1518 Greater Than 1518 Byte Frames Transmitted Register **/
#define GMAC_GMAC_GTBFT1518			MMIO32(GMAC_BASE + 0x130)
/** GMAC_GMAC_TUR Transmit Underruns Register **/
#define GMAC_GMAC_TUR			MMIO32(GMAC_BASE + 0x134)
/** GMAC_GMAC_SCF Single Collision Frames Register **/
#define GMAC_GMAC_SCF			MMIO32(GMAC_BASE + 0x138)
/** GMAC_GMAC_MCF Multiple Collision Frames Register **/
#define GMAC_GMAC_MCF			MMIO32(GMAC_BASE + 0x13c)
/** GMAC_GMAC_EC Excessive Collisions Register **/
#define GMAC_GMAC_EC			MMIO32(GMAC_BASE + 0x140)
/** GMAC_GMAC_LC Late Collisions Register **/
#define GMAC_GMAC_LC			MMIO32(GMAC_BASE + 0x144)
/** GMAC_GMAC_DTF Deferred Transmission Frames Register **/
#define GMAC_GMAC_DTF			MMIO32(GMAC_BASE + 0x148)
/** GMAC_GMAC_CSE Carrier Sense Errors Register **/
#define GMAC_GMAC_CSE			MMIO32(GMAC_BASE + 0x14c)
/** GMAC_GMAC_ORLO Octets Received Low Received Register **/
#define GMAC_GMAC_ORLO			MMIO32(GMAC_BASE + 0x150)
/** GMAC_GMAC_ORHI Octets Received High Received Register **/
#define GMAC_GMAC_ORHI			MMIO32(GMAC_BASE + 0x154)
/** GMAC_GMAC_FR Frames Received Register **/
#define GMAC_GMAC_FR			MMIO32(GMAC_BASE + 0x158)
/** GMAC_GMAC_BCFR Broadcast Frames Received Register **/
#define GMAC_GMAC_BCFR			MMIO32(GMAC_BASE + 0x15c)
/** GMAC_GMAC_MFR Multicast Frames Received Register **/
#define GMAC_GMAC_MFR			MMIO32(GMAC_BASE + 0x160)
/** GMAC_GMAC_PFR Pause Frames Received Register **/
#define GMAC_GMAC_PFR			MMIO32(GMAC_BASE + 0x164)
/** GMAC_GMAC_BFR64 64 Byte Frames Received Register **/
#define GMAC_GMAC_BFR64			MMIO32(GMAC_BASE + 0x168)
/** GMAC_GMAC_TBFR127 65 to 127 Byte Frames Received Register **/
#define GMAC_GMAC_TBFR127			MMIO32(GMAC_BASE + 0x16c)
/** GMAC_GMAC_TBFR255 128 to 255 Byte Frames Received Register **/
#define GMAC_GMAC_TBFR255			MMIO32(GMAC_BASE + 0x170)
/** GMAC_GMAC_TBFR511 256 to 511 Byte Frames Received Register **/
#define GMAC_GMAC_TBFR511			MMIO32(GMAC_BASE + 0x174)
/** GMAC_GMAC_TBFR1023 512 to 1023 Byte Frames Received Register **/
#define GMAC_GMAC_TBFR1023			MMIO32(GMAC_BASE + 0x178)
/** GMAC_GMAC_TBFR1518 1024 to 1518 Byte Frames Received Register **/
#define GMAC_GMAC_TBFR1518			MMIO32(GMAC_BASE + 0x17c)
/** GMAC_GMAC_TMXBFR 1519 to Maximum Byte Frames Received Register **/
#define GMAC_GMAC_TMXBFR			MMIO32(GMAC_BASE + 0x180)
/** GMAC_GMAC_UFR Undersize Frames Received Register **/
#define GMAC_GMAC_UFR			MMIO32(GMAC_BASE + 0x184)
/** GMAC_GMAC_OFR Oversize Frames Received Register **/
#define GMAC_GMAC_OFR			MMIO32(GMAC_BASE + 0x188)
/** GMAC_GMAC_JR Jabbers Received Register **/
#define GMAC_GMAC_JR			MMIO32(GMAC_BASE + 0x18c)
/** GMAC_GMAC_FCSE Frame Check Sequence Errors Register **/
#define GMAC_GMAC_FCSE			MMIO32(GMAC_BASE + 0x190)
/** GMAC_GMAC_LFFE Length Field Frame Errors Register **/
#define GMAC_GMAC_LFFE			MMIO32(GMAC_BASE + 0x194)
/** GMAC_GMAC_RSE Receive Symbol Errors Register **/
#define GMAC_GMAC_RSE			MMIO32(GMAC_BASE + 0x198)
/** GMAC_GMAC_AE Alignment Errors Register **/
#define GMAC_GMAC_AE			MMIO32(GMAC_BASE + 0x19c)
/** GMAC_GMAC_RRE Receive Resource Errors Register **/
#define GMAC_GMAC_RRE			MMIO32(GMAC_BASE + 0x1a0)
/** GMAC_GMAC_ROE Receive Overrun Register **/
#define GMAC_GMAC_ROE			MMIO32(GMAC_BASE + 0x1a4)
/** GMAC_GMAC_IHCE IP Header Checksum Errors Register **/
#define GMAC_GMAC_IHCE			MMIO32(GMAC_BASE + 0x1a8)
/** GMAC_GMAC_TCE TCP Checksum Errors Register **/
#define GMAC_GMAC_TCE			MMIO32(GMAC_BASE + 0x1ac)
/** GMAC_GMAC_UCE UDP Checksum Errors Register **/
#define GMAC_GMAC_UCE			MMIO32(GMAC_BASE + 0x1b0)
/** GMAC_GMAC_TISUBN 1588 Timer Increment Sub-nanoseconds Register **/
#define GMAC_GMAC_TISUBN			MMIO32(GMAC_BASE + 0x1bc)
/** GMAC_GMAC_TSH 1588 Timer Seconds High Register **/
#define GMAC_GMAC_TSH			MMIO32(GMAC_BASE + 0x1c0)
/** GMAC_GMAC_TSL 1588 Timer Seconds Low Register **/
#define GMAC_GMAC_TSL			MMIO32(GMAC_BASE + 0x1d0)
/** GMAC_GMAC_TN 1588 Timer Nanoseconds Register **/
#define GMAC_GMAC_TN			MMIO32(GMAC_BASE + 0x1d4)
/** GMAC_GMAC_TA 1588 Timer Adjust Register **/
#define GMAC_GMAC_TA			MMIO32(GMAC_BASE + 0x1d8)
/** GMAC_GMAC_TI 1588 Timer Increment Register **/
#define GMAC_GMAC_TI			MMIO32(GMAC_BASE + 0x1dc)
/** GMAC_GMAC_EFTSL PTP Event Frame Transmitted Seconds Low Register **/
#define GMAC_GMAC_EFTSL			MMIO32(GMAC_BASE + 0x1e0)
/** GMAC_GMAC_EFTN PTP Event Frame Transmitted Nanoseconds Register **/
#define GMAC_GMAC_EFTN			MMIO32(GMAC_BASE + 0x1e4)
/** GMAC_GMAC_EFRSL PTP Event Frame Received Seconds Low Register **/
#define GMAC_GMAC_EFRSL			MMIO32(GMAC_BASE + 0x1e8)
/** GMAC_GMAC_EFRN PTP Event Frame Received Nanoseconds Register **/
#define GMAC_GMAC_EFRN			MMIO32(GMAC_BASE + 0x1ec)
/** GMAC_GMAC_PEFTSL PTP Peer Event Frame Transmitted Seconds Low Register **/
#define GMAC_GMAC_PEFTSL			MMIO32(GMAC_BASE + 0x1f0)
/** GMAC_GMAC_PEFTN PTP Peer Event Frame Transmitted Nanoseconds Register **/
#define GMAC_GMAC_PEFTN			MMIO32(GMAC_BASE + 0x1f4)
/** GMAC_GMAC_PEFRSL PTP Peer Event Frame Received Seconds Low Register **/
#define GMAC_GMAC_PEFRSL			MMIO32(GMAC_BASE + 0x1f8)
/** GMAC_GMAC_PEFRN PTP Peer Event Frame Received Nanoseconds Register **/
#define GMAC_GMAC_PEFRN			MMIO32(GMAC_BASE + 0x1fc)
/** GMAC_GMAC_RXLPI Received LPI Transitions **/
#define GMAC_GMAC_RXLPI			MMIO32(GMAC_BASE + 0x270)
/** GMAC_GMAC_RXLPITIME Received LPI Time **/
#define GMAC_GMAC_RXLPITIME			MMIO32(GMAC_BASE + 0x274)
/** GMAC_GMAC_TXLPI Transmit LPI Transitions **/
#define GMAC_GMAC_TXLPI			MMIO32(GMAC_BASE + 0x278)
/** GMAC_GMAC_TXLPITIME Transmit LPI Time **/
#define GMAC_GMAC_TXLPITIME			MMIO32(GMAC_BASE + 0x27c)
/** GMAC_GMAC_ISRPQ[0] Interrupt Status Register Priority Queue (1..5) **/
#define GMAC_GMAC_ISRPQ[0]			MMIO32(GMAC_BASE + 0x400)
/** GMAC_GMAC_ISRPQ[1] Interrupt Status Register Priority Queue (1..5) **/
#define GMAC_GMAC_ISRPQ[1]			MMIO32(GMAC_BASE + 0x404)
/** GMAC_GMAC_ISRPQ[2] Interrupt Status Register Priority Queue (1..5) **/
#define GMAC_GMAC_ISRPQ[2]			MMIO32(GMAC_BASE + 0x408)
/** GMAC_GMAC_ISRPQ[3] Interrupt Status Register Priority Queue (1..5) **/
#define GMAC_GMAC_ISRPQ[3]			MMIO32(GMAC_BASE + 0x40c)
/** GMAC_GMAC_ISRPQ[4] Interrupt Status Register Priority Queue (1..5) **/
#define GMAC_GMAC_ISRPQ[4]			MMIO32(GMAC_BASE + 0x410)
/** GMAC_GMAC_TBQBAPQ[0] Transmit Buffer Queue Base Address Register Priority Queue (1..5) **/
#define GMAC_GMAC_TBQBAPQ[0]			MMIO32(GMAC_BASE + 0x440)
/** GMAC_GMAC_TBQBAPQ[1] Transmit Buffer Queue Base Address Register Priority Queue (1..5) **/
#define GMAC_GMAC_TBQBAPQ[1]			MMIO32(GMAC_BASE + 0x444)
/** GMAC_GMAC_TBQBAPQ[2] Transmit Buffer Queue Base Address Register Priority Queue (1..5) **/
#define GMAC_GMAC_TBQBAPQ[2]			MMIO32(GMAC_BASE + 0x448)
/** GMAC_GMAC_TBQBAPQ[3] Transmit Buffer Queue Base Address Register Priority Queue (1..5) **/
#define GMAC_GMAC_TBQBAPQ[3]			MMIO32(GMAC_BASE + 0x44c)
/** GMAC_GMAC_TBQBAPQ[4] Transmit Buffer Queue Base Address Register Priority Queue (1..5) **/
#define GMAC_GMAC_TBQBAPQ[4]			MMIO32(GMAC_BASE + 0x450)
/** GMAC_GMAC_RBQBAPQ[0] Receive Buffer Queue Base Address Register Priority Queue (1..5) **/
#define GMAC_GMAC_RBQBAPQ[0]			MMIO32(GMAC_BASE + 0x480)
/** GMAC_GMAC_RBQBAPQ[1] Receive Buffer Queue Base Address Register Priority Queue (1..5) **/
#define GMAC_GMAC_RBQBAPQ[1]			MMIO32(GMAC_BASE + 0x484)
/** GMAC_GMAC_RBQBAPQ[2] Receive Buffer Queue Base Address Register Priority Queue (1..5) **/
#define GMAC_GMAC_RBQBAPQ[2]			MMIO32(GMAC_BASE + 0x488)
/** GMAC_GMAC_RBQBAPQ[3] Receive Buffer Queue Base Address Register Priority Queue (1..5) **/
#define GMAC_GMAC_RBQBAPQ[3]			MMIO32(GMAC_BASE + 0x48c)
/** GMAC_GMAC_RBQBAPQ[4] Receive Buffer Queue Base Address Register Priority Queue (1..5) **/
#define GMAC_GMAC_RBQBAPQ[4]			MMIO32(GMAC_BASE + 0x490)
/** GMAC_GMAC_RBSRPQ[0] Receive Buffer Size Register Priority Queue (1..5) **/
#define GMAC_GMAC_RBSRPQ[0]			MMIO32(GMAC_BASE + 0x4a0)
/** GMAC_GMAC_RBSRPQ[1] Receive Buffer Size Register Priority Queue (1..5) **/
#define GMAC_GMAC_RBSRPQ[1]			MMIO32(GMAC_BASE + 0x4a4)
/** GMAC_GMAC_RBSRPQ[2] Receive Buffer Size Register Priority Queue (1..5) **/
#define GMAC_GMAC_RBSRPQ[2]			MMIO32(GMAC_BASE + 0x4a8)
/** GMAC_GMAC_RBSRPQ[3] Receive Buffer Size Register Priority Queue (1..5) **/
#define GMAC_GMAC_RBSRPQ[3]			MMIO32(GMAC_BASE + 0x4ac)
/** GMAC_GMAC_RBSRPQ[4] Receive Buffer Size Register Priority Queue (1..5) **/
#define GMAC_GMAC_RBSRPQ[4]			MMIO32(GMAC_BASE + 0x4b0)
/** GMAC_GMAC_CBSCR Credit-Based Shaping Control Register **/
#define GMAC_GMAC_CBSCR			MMIO32(GMAC_BASE + 0x4bc)
/** GMAC_GMAC_CBSISQA Credit-Based Shaping IdleSlope Register for Queue A **/
#define GMAC_GMAC_CBSISQA			MMIO32(GMAC_BASE + 0x4c0)
/** GMAC_GMAC_CBSISQB Credit-Based Shaping IdleSlope Register for Queue B **/
#define GMAC_GMAC_CBSISQB			MMIO32(GMAC_BASE + 0x4c4)
/** GMAC_GMAC_ST1RPQ[0] Screening Type 1 Register Priority Queue **/
#define GMAC_GMAC_ST1RPQ[0]			MMIO32(GMAC_BASE + 0x500)
/** GMAC_GMAC_ST1RPQ[1] Screening Type 1 Register Priority Queue **/
#define GMAC_GMAC_ST1RPQ[1]			MMIO32(GMAC_BASE + 0x504)
/** GMAC_GMAC_ST1RPQ[2] Screening Type 1 Register Priority Queue **/
#define GMAC_GMAC_ST1RPQ[2]			MMIO32(GMAC_BASE + 0x508)
/** GMAC_GMAC_ST1RPQ[3] Screening Type 1 Register Priority Queue **/
#define GMAC_GMAC_ST1RPQ[3]			MMIO32(GMAC_BASE + 0x50c)
/** GMAC_GMAC_ST2RPQ[0] Screening Type 2 Register Priority Queue **/
#define GMAC_GMAC_ST2RPQ[0]			MMIO32(GMAC_BASE + 0x540)
/** GMAC_GMAC_ST2RPQ[1] Screening Type 2 Register Priority Queue **/
#define GMAC_GMAC_ST2RPQ[1]			MMIO32(GMAC_BASE + 0x544)
/** GMAC_GMAC_ST2RPQ[2] Screening Type 2 Register Priority Queue **/
#define GMAC_GMAC_ST2RPQ[2]			MMIO32(GMAC_BASE + 0x548)
/** GMAC_GMAC_ST2RPQ[3] Screening Type 2 Register Priority Queue **/
#define GMAC_GMAC_ST2RPQ[3]			MMIO32(GMAC_BASE + 0x54c)
/** GMAC_GMAC_ST2RPQ[4] Screening Type 2 Register Priority Queue **/
#define GMAC_GMAC_ST2RPQ[4]			MMIO32(GMAC_BASE + 0x550)
/** GMAC_GMAC_ST2RPQ[5] Screening Type 2 Register Priority Queue **/
#define GMAC_GMAC_ST2RPQ[5]			MMIO32(GMAC_BASE + 0x554)
/** GMAC_GMAC_ST2RPQ[6] Screening Type 2 Register Priority Queue **/
#define GMAC_GMAC_ST2RPQ[6]			MMIO32(GMAC_BASE + 0x558)
/** GMAC_GMAC_ST2RPQ[7] Screening Type 2 Register Priority Queue **/
#define GMAC_GMAC_ST2RPQ[7]			MMIO32(GMAC_BASE + 0x55c)
/** GMAC_GMAC_IERPQ[0] Interrupt Enable Register Priority Queue (1..5) **/
#define GMAC_GMAC_IERPQ[0]			MMIO32(GMAC_BASE + 0x600)
/** GMAC_GMAC_IERPQ[1] Interrupt Enable Register Priority Queue (1..5) **/
#define GMAC_GMAC_IERPQ[1]			MMIO32(GMAC_BASE + 0x604)
/** GMAC_GMAC_IERPQ[2] Interrupt Enable Register Priority Queue (1..5) **/
#define GMAC_GMAC_IERPQ[2]			MMIO32(GMAC_BASE + 0x608)
/** GMAC_GMAC_IERPQ[3] Interrupt Enable Register Priority Queue (1..5) **/
#define GMAC_GMAC_IERPQ[3]			MMIO32(GMAC_BASE + 0x60c)
/** GMAC_GMAC_IERPQ[4] Interrupt Enable Register Priority Queue (1..5) **/
#define GMAC_GMAC_IERPQ[4]			MMIO32(GMAC_BASE + 0x610)
/** GMAC_GMAC_IDRPQ[0] Interrupt Disable Register Priority Queue (1..5) **/
#define GMAC_GMAC_IDRPQ[0]			MMIO32(GMAC_BASE + 0x620)
/** GMAC_GMAC_IDRPQ[1] Interrupt Disable Register Priority Queue (1..5) **/
#define GMAC_GMAC_IDRPQ[1]			MMIO32(GMAC_BASE + 0x624)
/** GMAC_GMAC_IDRPQ[2] Interrupt Disable Register Priority Queue (1..5) **/
#define GMAC_GMAC_IDRPQ[2]			MMIO32(GMAC_BASE + 0x628)
/** GMAC_GMAC_IDRPQ[3] Interrupt Disable Register Priority Queue (1..5) **/
#define GMAC_GMAC_IDRPQ[3]			MMIO32(GMAC_BASE + 0x62c)
/** GMAC_GMAC_IDRPQ[4] Interrupt Disable Register Priority Queue (1..5) **/
#define GMAC_GMAC_IDRPQ[4]			MMIO32(GMAC_BASE + 0x630)
/** GMAC_GMAC_IMRPQ[0] Interrupt Mask Register Priority Queue (1..5) **/
#define GMAC_GMAC_IMRPQ[0]			MMIO32(GMAC_BASE + 0x640)
/** GMAC_GMAC_IMRPQ[1] Interrupt Mask Register Priority Queue (1..5) **/
#define GMAC_GMAC_IMRPQ[1]			MMIO32(GMAC_BASE + 0x644)
/** GMAC_GMAC_IMRPQ[2] Interrupt Mask Register Priority Queue (1..5) **/
#define GMAC_GMAC_IMRPQ[2]			MMIO32(GMAC_BASE + 0x648)
/** GMAC_GMAC_IMRPQ[3] Interrupt Mask Register Priority Queue (1..5) **/
#define GMAC_GMAC_IMRPQ[3]			MMIO32(GMAC_BASE + 0x64c)
/** GMAC_GMAC_IMRPQ[4] Interrupt Mask Register Priority Queue (1..5) **/
#define GMAC_GMAC_IMRPQ[4]			MMIO32(GMAC_BASE + 0x650)
/** GMAC_GMAC_ST2ER[0] Screening Type 2 Ethertype Register **/
#define GMAC_GMAC_ST2ER[0]			MMIO32(GMAC_BASE + 0x6e0)
/** GMAC_GMAC_ST2ER[1] Screening Type 2 Ethertype Register **/
#define GMAC_GMAC_ST2ER[1]			MMIO32(GMAC_BASE + 0x6e4)
/** GMAC_GMAC_ST2ER[2] Screening Type 2 Ethertype Register **/
#define GMAC_GMAC_ST2ER[2]			MMIO32(GMAC_BASE + 0x6e8)
/** GMAC_GMAC_ST2ER[3] Screening Type 2 Ethertype Register **/
#define GMAC_GMAC_ST2ER[3]			MMIO32(GMAC_BASE + 0x6ec)
/** GMAC_GMAC_ST2CW[0]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[0]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x700)
/** GMAC_GMAC_ST2CW[0]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[0]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x704)
/** GMAC_GMAC_ST2CW[1]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[1]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x708)
/** GMAC_GMAC_ST2CW[1]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[1]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x70c)
/** GMAC_GMAC_ST2CW[2]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[2]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x710)
/** GMAC_GMAC_ST2CW[2]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[2]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x714)
/** GMAC_GMAC_ST2CW[3]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[3]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x718)
/** GMAC_GMAC_ST2CW[3]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[3]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x71c)
/** GMAC_GMAC_ST2CW[4]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[4]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x720)
/** GMAC_GMAC_ST2CW[4]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[4]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x724)
/** GMAC_GMAC_ST2CW[5]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[5]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x728)
/** GMAC_GMAC_ST2CW[5]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[5]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x72c)
/** GMAC_GMAC_ST2CW[6]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[6]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x730)
/** GMAC_GMAC_ST2CW[6]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[6]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x734)
/** GMAC_GMAC_ST2CW[7]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[7]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x738)
/** GMAC_GMAC_ST2CW[7]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[7]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x73c)
/** GMAC_GMAC_ST2CW[8]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[8]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x740)
/** GMAC_GMAC_ST2CW[8]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[8]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x744)
/** GMAC_GMAC_ST2CW[9]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[9]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x748)
/** GMAC_GMAC_ST2CW[9]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[9]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x74c)
/** GMAC_GMAC_ST2CW[10]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[10]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x750)
/** GMAC_GMAC_ST2CW[10]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[10]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x754)
/** GMAC_GMAC_ST2CW[11]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[11]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x758)
/** GMAC_GMAC_ST2CW[11]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[11]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x75c)
/** GMAC_GMAC_ST2CW[12]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[12]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x760)
/** GMAC_GMAC_ST2CW[12]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[12]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x764)
/** GMAC_GMAC_ST2CW[13]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[13]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x768)
/** GMAC_GMAC_ST2CW[13]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[13]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x76c)
/** GMAC_GMAC_ST2CW[14]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[14]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x770)
/** GMAC_GMAC_ST2CW[14]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[14]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x774)
/** GMAC_GMAC_ST2CW[15]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[15]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x778)
/** GMAC_GMAC_ST2CW[15]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[15]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x77c)
