grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
/** GMAC_GMAC_ST2CW[16]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[16]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x780)
/** GMAC_GMAC_ST2CW[16]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[16]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x784)
/** GMAC_GMAC_ST2CW[17]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[17]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x788)
/** GMAC_GMAC_ST2CW[17]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[17]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x78c)
/** GMAC_GMAC_ST2CW[18]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[18]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x790)
/** GMAC_GMAC_ST2CW[18]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[18]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x794)
/** GMAC_GMAC_ST2CW[19]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[19]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x798)
/** GMAC_GMAC_ST2CW[19]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[19]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x79c)
/** GMAC_GMAC_ST2CW[20]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[20]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x7a0)
/** GMAC_GMAC_ST2CW[20]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[20]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x7a4)
/** GMAC_GMAC_ST2CW[21]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[21]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x7a8)
/** GMAC_GMAC_ST2CW[21]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[21]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x7ac)
/** GMAC_GMAC_ST2CW[22]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[22]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x7b0)
/** GMAC_GMAC_ST2CW[22]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[22]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x7b4)
/** GMAC_GMAC_ST2CW[23]_GMAC_ST2CW0 Screening Type 2 Compare Word 0 Register **/
#define GMAC_GMAC_ST2CW[23]_GMAC_ST2CW0			MMIO32(GMAC_BASE + 0x7b8)
/** GMAC_GMAC_ST2CW[23]_GMAC_ST2CW1 Screening Type 2 Compare Word 1 Register **/
#define GMAC_GMAC_ST2CW[23]_GMAC_ST2CW1			MMIO32(GMAC_BASE + 0x7bc)

/**@}*/


/** @defgroup gmac_gmac_ncr GMACNCR Network Control Register
@{*/

/** GMAC_GMAC_NCR_TXLPIEN Enable LPI Transmission **/
#define GMAC_GMAC_NCR_TXLPIEN		(1 << 19)
/** GMAC_GMAC_NCR_FNP Flush Next Packet **/
#define GMAC_GMAC_NCR_FNP		(1 << 18)
/** GMAC_GMAC_NCR_TXPBPF Transmit PFC Priority-based Pause Frame **/
#define GMAC_GMAC_NCR_TXPBPF		(1 << 17)
/** GMAC_GMAC_NCR_ENPBPR Enable PFC Priority-based Pause Reception **/
#define GMAC_GMAC_NCR_ENPBPR		(1 << 16)
/** GMAC_GMAC_NCR_SRTSM Store Receive Time Stamp to Memory **/
#define GMAC_GMAC_NCR_SRTSM		(1 << 15)
/** GMAC_GMAC_NCR_TXZQPF Transmit Zero Quantum Pause Frame **/
#define GMAC_GMAC_NCR_TXZQPF		(1 << 12)
/** GMAC_GMAC_NCR_TXPF Transmit Pause Frame **/
#define GMAC_GMAC_NCR_TXPF		(1 << 11)
/** GMAC_GMAC_NCR_THALT Transmit Halt **/
#define GMAC_GMAC_NCR_THALT		(1 << 10)
/** GMAC_GMAC_NCR_TSTART Start Transmission **/
#define GMAC_GMAC_NCR_TSTART		(1 << 9)
/** GMAC_GMAC_NCR_BP Back pressure **/
#define GMAC_GMAC_NCR_BP		(1 << 8)
/** GMAC_GMAC_NCR_WESTAT Write Enable for Statistics Registers **/
#define GMAC_GMAC_NCR_WESTAT		(1 << 7)
/** GMAC_GMAC_NCR_INCSTAT Increment Statistics Registers **/
#define GMAC_GMAC_NCR_INCSTAT		(1 << 6)
/** GMAC_GMAC_NCR_CLRSTAT Clear Statistics Registers **/
#define GMAC_GMAC_NCR_CLRSTAT		(1 << 5)
/** GMAC_GMAC_NCR_MPE Management Port Enable **/
#define GMAC_GMAC_NCR_MPE		(1 << 4)
/** GMAC_GMAC_NCR_TXEN Transmit Enable **/
#define GMAC_GMAC_NCR_TXEN		(1 << 3)
/** GMAC_GMAC_NCR_RXEN Receive Enable **/
#define GMAC_GMAC_NCR_RXEN		(1 << 2)
/** GMAC_GMAC_NCR_LBL Loop Back Local **/
#define GMAC_GMAC_NCR_LBL		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_ncfgr GMACNCFGR Network Configuration Register
@{*/

/** GMAC_GMAC_NCFGR_IRXER Ignore IPG GRXER **/
#define GMAC_GMAC_NCFGR_IRXER		(1 << 30)
/** GMAC_GMAC_NCFGR_RXBP Receive Bad Preamble **/
#define GMAC_GMAC_NCFGR_RXBP		(1 << 29)
/** GMAC_GMAC_NCFGR_IPGSEN IP Stretch Enable **/
#define GMAC_GMAC_NCFGR_IPGSEN		(1 << 28)
/** GMAC_GMAC_NCFGR_IRXFCS Ignore RX FCS **/
#define GMAC_GMAC_NCFGR_IRXFCS		(1 << 26)
/** GMAC_GMAC_NCFGR_EFRHD Enable Frames Received in Half Duplex **/
#define GMAC_GMAC_NCFGR_EFRHD		(1 << 25)
/** GMAC_GMAC_NCFGR_RXCOEN Receive Checksum Offload Enable **/
#define GMAC_GMAC_NCFGR_RXCOEN		(1 << 24)
/** GMAC_GMAC_NCFGR_DCPF Disable Copy of Pause Frames **/
#define GMAC_GMAC_NCFGR_DCPF		(1 << 23)

#define GMAC_GMAC_NCFGR_DBW_SHIFT		21
#define GMAC_GMAC_NCFGR_DBW_MASK		0x03
/** @defgroup gmac_gmac_ncfgr_dbw DBW Data Bus Width
@{*/
/**@}*/


#define GMAC_GMAC_NCFGR_CLK_SHIFT		18
#define GMAC_GMAC_NCFGR_CLK_MASK		0x07
/** @defgroup gmac_gmac_ncfgr_clk CLK MDC CLock Division
@{*/
/**@}*/

/** GMAC_GMAC_NCFGR_RFCS Remove FCS **/
#define GMAC_GMAC_NCFGR_RFCS		(1 << 17)
/** GMAC_GMAC_NCFGR_LFERD Length Field Error Frame Discard **/
#define GMAC_GMAC_NCFGR_LFERD		(1 << 16)

#define GMAC_GMAC_NCFGR_RXBUFO_SHIFT		14
#define GMAC_GMAC_NCFGR_RXBUFO_MASK		0x03
/** @defgroup gmac_gmac_ncfgr_rxbufo RXBUFO Receive Buffer Offset
@{*/
/**@}*/

/** GMAC_GMAC_NCFGR_PEN Pause Enable **/
#define GMAC_GMAC_NCFGR_PEN		(1 << 13)
/** GMAC_GMAC_NCFGR_RTY Retry Test **/
#define GMAC_GMAC_NCFGR_RTY		(1 << 12)
/** GMAC_GMAC_NCFGR_MAXFS 1536 Maximum Frame Size **/
#define GMAC_GMAC_NCFGR_MAXFS		(1 << 8)
/** GMAC_GMAC_NCFGR_UNIHEN Unicast Hash Enable **/
#define GMAC_GMAC_NCFGR_UNIHEN		(1 << 7)
/** GMAC_GMAC_NCFGR_MTIHEN Multicast Hash Enable **/
#define GMAC_GMAC_NCFGR_MTIHEN		(1 << 6)
/** GMAC_GMAC_NCFGR_NBC No Broadcast **/
#define GMAC_GMAC_NCFGR_NBC		(1 << 5)
/** GMAC_GMAC_NCFGR_CAF Copy All Frames **/
#define GMAC_GMAC_NCFGR_CAF		(1 << 4)
/** GMAC_GMAC_NCFGR_JFRAME Jumbo Frame Size **/
#define GMAC_GMAC_NCFGR_JFRAME		(1 << 3)
/** GMAC_GMAC_NCFGR_DNVLAN Discard Non-VLAN FRAMES **/
#define GMAC_GMAC_NCFGR_DNVLAN		(1 << 2)
/** GMAC_GMAC_NCFGR_FD Full Duplex **/
#define GMAC_GMAC_NCFGR_FD		(1 << 1)
/** GMAC_GMAC_NCFGR_SPD Speed **/
#define GMAC_GMAC_NCFGR_SPD		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_nsr GMACNSR Network Status Register
@{*/

/** GMAC_GMAC_NSR_RXLPIS LPI Indication **/
#define GMAC_GMAC_NSR_RXLPIS		(1 << 7)
/** GMAC_GMAC_NSR_IDLE PHY Management Logic Idle **/
#define GMAC_GMAC_NSR_IDLE		(1 << 2)
/** GMAC_GMAC_NSR_MDIO MDIO Input Status **/
#define GMAC_GMAC_NSR_MDIO		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_ur GMACUR User Register
@{*/

