grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
/** GMAC_GMAC_UR_RMII Reduced MII Mode **/
#define GMAC_GMAC_UR_RMII		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_dcfgr GMACDCFGR DMA Configuration Register
@{*/

/** GMAC_GMAC_DCFGR_DDRP DMA Discard Receive Packets **/
#define GMAC_GMAC_DCFGR_DDRP		(1 << 24)

#define GMAC_GMAC_DCFGR_DRBS_SHIFT		16
#define GMAC_GMAC_DCFGR_DRBS_MASK		0xff
/** @defgroup gmac_gmac_dcfgr_drbs DRBS DMA Receive Buffer Size
@{*/
/**@}*/

/** GMAC_GMAC_DCFGR_TXCOEN Transmitter Checksum Generation Offload Enable **/
#define GMAC_GMAC_DCFGR_TXCOEN		(1 << 11)
/** GMAC_GMAC_DCFGR_TXPBMS Transmitter Packet Buffer Memory Size Select **/
#define GMAC_GMAC_DCFGR_TXPBMS		(1 << 10)

#define GMAC_GMAC_DCFGR_RXBMS_SHIFT		8
#define GMAC_GMAC_DCFGR_RXBMS_MASK		0x03
/** @defgroup gmac_gmac_dcfgr_rxbms RXBMS Receiver Packet Buffer Memory Size Select
@{*/
/**@}*/

/** GMAC_GMAC_DCFGR_ESPA Endian Swap Mode Enable for Packet Data Accesses **/
#define GMAC_GMAC_DCFGR_ESPA		(1 << 7)
/** GMAC_GMAC_DCFGR_ESMA Endian Swap Mode Enable for Management Descriptor Accesses **/
#define GMAC_GMAC_DCFGR_ESMA		(1 << 6)

#define GMAC_GMAC_DCFGR_FBLDO_SHIFT		0
#define GMAC_GMAC_DCFGR_FBLDO_MASK		0x1f
/** @defgroup gmac_gmac_dcfgr_fbldo FBLDO Fixed Burst Length for DMA Data Operations:
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tsr GMACTSR Transmit Status Register
@{*/

/** GMAC_GMAC_TSR_HRESP HRESP Not OK **/
#define GMAC_GMAC_TSR_HRESP		(1 << 8)
/** GMAC_GMAC_TSR_TXCOMP Transmit Complete **/
#define GMAC_GMAC_TSR_TXCOMP		(1 << 5)
/** GMAC_GMAC_TSR_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_TSR_TFC		(1 << 4)
/** GMAC_GMAC_TSR_TXGO Transmit Go **/
#define GMAC_GMAC_TSR_TXGO		(1 << 3)
/** GMAC_GMAC_TSR_RLE Retry Limit Exceeded **/
#define GMAC_GMAC_TSR_RLE		(1 << 2)
/** GMAC_GMAC_TSR_COL Collision Occurred **/
#define GMAC_GMAC_TSR_COL		(1 << 1)
/** GMAC_GMAC_TSR_UBR Used Bit Read **/
#define GMAC_GMAC_TSR_UBR		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_rbqb GMACRBQB Receive Buffer Queue Base Address Register
@{*/


#define GMAC_GMAC_RBQB_ADDR_SHIFT		2
#define GMAC_GMAC_RBQB_ADDR_MASK		0x3fffffff
/** @defgroup gmac_gmac_rbqb_addr ADDR Receive Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbqb GMACTBQB Transmit Buffer Queue Base Address Register
@{*/


#define GMAC_GMAC_TBQB_ADDR_SHIFT		2
#define GMAC_GMAC_TBQB_ADDR_MASK		0x3fffffff
/** @defgroup gmac_gmac_tbqb_addr ADDR Transmit Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rsr GMACRSR Receive Status Register
@{*/

/** GMAC_GMAC_RSR_HNO HRESP Not OK **/
#define GMAC_GMAC_RSR_HNO		(1 << 3)
/** GMAC_GMAC_RSR_RXOVR Receive Overrun **/
#define GMAC_GMAC_RSR_RXOVR		(1 << 2)
/** GMAC_GMAC_RSR_REC Frame Received **/
#define GMAC_GMAC_RSR_REC		(1 << 1)
/** GMAC_GMAC_RSR_BNA Buffer Not Available **/
#define GMAC_GMAC_RSR_BNA		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_isr GMACISR Interrupt Status Register
@{*/

/** GMAC_GMAC_ISR_TSUTIMCOMP TSU Timer Comparison **/
#define GMAC_GMAC_ISR_TSUTIMCOMP		(1 << 29)
/** GMAC_GMAC_ISR_WOL Wake On LAN **/
#define GMAC_GMAC_ISR_WOL		(1 << 28)
/** GMAC_GMAC_ISR_RXLPISBC Receive LPI indication Status Bit Change **/
#define GMAC_GMAC_ISR_RXLPISBC		(1 << 27)
/** GMAC_GMAC_ISR_SRI TSU Seconds Register Increment **/
#define GMAC_GMAC_ISR_SRI		(1 << 26)
/** GMAC_GMAC_ISR_PDRSFT PDelay Response Frame Transmitted **/
#define GMAC_GMAC_ISR_PDRSFT		(1 << 25)
/** GMAC_GMAC_ISR_PDRQFT PDelay Request Frame Transmitted **/
#define GMAC_GMAC_ISR_PDRQFT		(1 << 24)
/** GMAC_GMAC_ISR_PDRSFR PDelay Response Frame Received **/
#define GMAC_GMAC_ISR_PDRSFR		(1 << 23)
/** GMAC_GMAC_ISR_PDRQFR PDelay Request Frame Received **/
#define GMAC_GMAC_ISR_PDRQFR		(1 << 22)
/** GMAC_GMAC_ISR_SFT PTP Sync Frame Transmitted **/
#define GMAC_GMAC_ISR_SFT		(1 << 21)
/** GMAC_GMAC_ISR_DRQFT PTP Delay Request Frame Transmitted **/
#define GMAC_GMAC_ISR_DRQFT		(1 << 20)
/** GMAC_GMAC_ISR_SFR PTP Sync Frame Received **/
#define GMAC_GMAC_ISR_SFR		(1 << 19)
/** GMAC_GMAC_ISR_DRQFR PTP Delay Request Frame Received **/
#define GMAC_GMAC_ISR_DRQFR		(1 << 18)
/** GMAC_GMAC_ISR_PFTR Pause Frame Transmitted **/
#define GMAC_GMAC_ISR_PFTR		(1 << 14)
/** GMAC_GMAC_ISR_PTZ Pause Time Zero **/
#define GMAC_GMAC_ISR_PTZ		(1 << 13)
/** GMAC_GMAC_ISR_PFNZ Pause Frame with Non-zero Pause Quantum Received **/
#define GMAC_GMAC_ISR_PFNZ		(1 << 12)
/** GMAC_GMAC_ISR_HRESP HRESP Not OK **/
#define GMAC_GMAC_ISR_HRESP		(1 << 11)
/** GMAC_GMAC_ISR_ROVR Receive Overrun **/
#define GMAC_GMAC_ISR_ROVR		(1 << 10)
/** GMAC_GMAC_ISR_TCOMP Transmit Complete **/
#define GMAC_GMAC_ISR_TCOMP		(1 << 7)
/** GMAC_GMAC_ISR_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_ISR_TFC		(1 << 6)
/** GMAC_GMAC_ISR_RLEX Retry Limit Exceeded **/
#define GMAC_GMAC_ISR_RLEX		(1 << 5)
/** GMAC_GMAC_ISR_TUR Transmit Underrun **/
#define GMAC_GMAC_ISR_TUR		(1 << 4)
/** GMAC_GMAC_ISR_TXUBR TX Used Bit Read **/
#define GMAC_GMAC_ISR_TXUBR		(1 << 3)
/** GMAC_GMAC_ISR_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_ISR_RXUBR		(1 << 2)
/** GMAC_GMAC_ISR_RCOMP Receive Complete **/
#define GMAC_GMAC_ISR_RCOMP		(1 << 1)
/** GMAC_GMAC_ISR_MFS Management Frame Sent **/
#define GMAC_GMAC_ISR_MFS		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_ier GMACIER Interrupt Enable Register
@{*/

/** GMAC_GMAC_IER_TSUTIMCOMP TSU Timer Comparison **/
#define GMAC_GMAC_IER_TSUTIMCOMP		(1 << 29)
/** GMAC_GMAC_IER_WOL Wake On LAN **/
#define GMAC_GMAC_IER_WOL		(1 << 28)
/** GMAC_GMAC_IER_RXLPISBC Enable RX LPI Indication **/
#define GMAC_GMAC_IER_RXLPISBC		(1 << 27)
/** GMAC_GMAC_IER_SRI TSU Seconds Register Increment **/
#define GMAC_GMAC_IER_SRI		(1 << 26)
/** GMAC_GMAC_IER_PDRSFT PDelay Response Frame Transmitted **/
#define GMAC_GMAC_IER_PDRSFT		(1 << 25)
/** GMAC_GMAC_IER_PDRQFT PDelay Request Frame Transmitted **/
#define GMAC_GMAC_IER_PDRQFT		(1 << 24)
/** GMAC_GMAC_IER_PDRSFR PDelay Response Frame Received **/
#define GMAC_GMAC_IER_PDRSFR		(1 << 23)
/** GMAC_GMAC_IER_PDRQFR PDelay Request Frame Received **/
#define GMAC_GMAC_IER_PDRQFR		(1 << 22)
/** GMAC_GMAC_IER_SFT PTP Sync Frame Transmitted **/
#define GMAC_GMAC_IER_SFT		(1 << 21)
/** GMAC_GMAC_IER_DRQFT PTP Delay Request Frame Transmitted **/
#define GMAC_GMAC_IER_DRQFT		(1 << 20)
/** GMAC_GMAC_IER_SFR PTP Sync Frame Received **/
#define GMAC_GMAC_IER_SFR		(1 << 19)
/** GMAC_GMAC_IER_DRQFR PTP Delay Request Frame Received **/
#define GMAC_GMAC_IER_DRQFR		(1 << 18)
/** GMAC_GMAC_IER_EXINT External Interrupt **/
#define GMAC_GMAC_IER_EXINT		(1 << 15)
/** GMAC_GMAC_IER_PFTR Pause Frame Transmitted **/
#define GMAC_GMAC_IER_PFTR		(1 << 14)
/** GMAC_GMAC_IER_PTZ Pause Time Zero **/
#define GMAC_GMAC_IER_PTZ		(1 << 13)
/** GMAC_GMAC_IER_PFNZ Pause Frame with Non-zero Pause Quantum Received **/
#define GMAC_GMAC_IER_PFNZ		(1 << 12)
/** GMAC_GMAC_IER_HRESP HRESP Not OK **/
#define GMAC_GMAC_IER_HRESP		(1 << 11)
/** GMAC_GMAC_IER_ROVR Receive Overrun **/
#define GMAC_GMAC_IER_ROVR		(1 << 10)
/** GMAC_GMAC_IER_TCOMP Transmit Complete **/
#define GMAC_GMAC_IER_TCOMP		(1 << 7)
/** GMAC_GMAC_IER_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IER_TFC		(1 << 6)
/** GMAC_GMAC_IER_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IER_RLEX		(1 << 5)
/** GMAC_GMAC_IER_TUR Transmit Underrun **/
#define GMAC_GMAC_IER_TUR		(1 << 4)
/** GMAC_GMAC_IER_TXUBR TX Used Bit Read **/
#define GMAC_GMAC_IER_TXUBR		(1 << 3)
/** GMAC_GMAC_IER_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IER_RXUBR		(1 << 2)
/** GMAC_GMAC_IER_RCOMP Receive Complete **/
#define GMAC_GMAC_IER_RCOMP		(1 << 1)
/** GMAC_GMAC_IER_MFS Management Frame Sent **/
#define GMAC_GMAC_IER_MFS		(1 << 0)

/**@}*/

