grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
/** @defgroup gmac_gmac_idr GMACIDR Interrupt Disable Register
@{*/

/** GMAC_GMAC_IDR_TSUTIMCOMP TSU Timer Comparison **/
#define GMAC_GMAC_IDR_TSUTIMCOMP		(1 << 29)
/** GMAC_GMAC_IDR_WOL Wake On LAN **/
#define GMAC_GMAC_IDR_WOL		(1 << 28)
/** GMAC_GMAC_IDR_RXLPISBC Enable RX LPI Indication **/
#define GMAC_GMAC_IDR_RXLPISBC		(1 << 27)
/** GMAC_GMAC_IDR_SRI TSU Seconds Register Increment **/
#define GMAC_GMAC_IDR_SRI		(1 << 26)
/** GMAC_GMAC_IDR_PDRSFT PDelay Response Frame Transmitted **/
#define GMAC_GMAC_IDR_PDRSFT		(1 << 25)
/** GMAC_GMAC_IDR_PDRQFT PDelay Request Frame Transmitted **/
#define GMAC_GMAC_IDR_PDRQFT		(1 << 24)
/** GMAC_GMAC_IDR_PDRSFR PDelay Response Frame Received **/
#define GMAC_GMAC_IDR_PDRSFR		(1 << 23)
/** GMAC_GMAC_IDR_PDRQFR PDelay Request Frame Received **/
#define GMAC_GMAC_IDR_PDRQFR		(1 << 22)
/** GMAC_GMAC_IDR_SFT PTP Sync Frame Transmitted **/
#define GMAC_GMAC_IDR_SFT		(1 << 21)
/** GMAC_GMAC_IDR_DRQFT PTP Delay Request Frame Transmitted **/
#define GMAC_GMAC_IDR_DRQFT		(1 << 20)
/** GMAC_GMAC_IDR_SFR PTP Sync Frame Received **/
#define GMAC_GMAC_IDR_SFR		(1 << 19)
/** GMAC_GMAC_IDR_DRQFR PTP Delay Request Frame Received **/
#define GMAC_GMAC_IDR_DRQFR		(1 << 18)
/** GMAC_GMAC_IDR_EXINT External Interrupt **/
#define GMAC_GMAC_IDR_EXINT		(1 << 15)
/** GMAC_GMAC_IDR_PFTR Pause Frame Transmitted **/
#define GMAC_GMAC_IDR_PFTR		(1 << 14)
/** GMAC_GMAC_IDR_PTZ Pause Time Zero **/
#define GMAC_GMAC_IDR_PTZ		(1 << 13)
/** GMAC_GMAC_IDR_PFNZ Pause Frame with Non-zero Pause Quantum Received **/
#define GMAC_GMAC_IDR_PFNZ		(1 << 12)
/** GMAC_GMAC_IDR_HRESP HRESP Not OK **/
#define GMAC_GMAC_IDR_HRESP		(1 << 11)
/** GMAC_GMAC_IDR_ROVR Receive Overrun **/
#define GMAC_GMAC_IDR_ROVR		(1 << 10)
/** GMAC_GMAC_IDR_TCOMP Transmit Complete **/
#define GMAC_GMAC_IDR_TCOMP		(1 << 7)
/** GMAC_GMAC_IDR_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IDR_TFC		(1 << 6)
/** GMAC_GMAC_IDR_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IDR_RLEX		(1 << 5)
/** GMAC_GMAC_IDR_TUR Transmit Underrun **/
#define GMAC_GMAC_IDR_TUR		(1 << 4)
/** GMAC_GMAC_IDR_TXUBR TX Used Bit Read **/
#define GMAC_GMAC_IDR_TXUBR		(1 << 3)
/** GMAC_GMAC_IDR_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IDR_RXUBR		(1 << 2)
/** GMAC_GMAC_IDR_RCOMP Receive Complete **/
#define GMAC_GMAC_IDR_RCOMP		(1 << 1)
/** GMAC_GMAC_IDR_MFS Management Frame Sent **/
#define GMAC_GMAC_IDR_MFS		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_imr GMACIMR Interrupt Mask Register
@{*/

/** GMAC_GMAC_IMR_TSUTIMCOMP TSU Timer Comparison **/
#define GMAC_GMAC_IMR_TSUTIMCOMP		(1 << 29)
/** GMAC_GMAC_IMR_WOL Wake On LAN **/
#define GMAC_GMAC_IMR_WOL		(1 << 28)
/** GMAC_GMAC_IMR_RXLPISBC Enable RX LPI Indication **/
#define GMAC_GMAC_IMR_RXLPISBC		(1 << 27)
/** GMAC_GMAC_IMR_SRI TSU Seconds Register Increment **/
#define GMAC_GMAC_IMR_SRI		(1 << 26)
/** GMAC_GMAC_IMR_PDRSFT PDelay Response Frame Transmitted **/
#define GMAC_GMAC_IMR_PDRSFT		(1 << 25)
/** GMAC_GMAC_IMR_PDRQFT PDelay Request Frame Transmitted **/
#define GMAC_GMAC_IMR_PDRQFT		(1 << 24)
/** GMAC_GMAC_IMR_PDRSFR PDelay Response Frame Received **/
#define GMAC_GMAC_IMR_PDRSFR		(1 << 23)
/** GMAC_GMAC_IMR_PDRQFR PDelay Request Frame Received **/
#define GMAC_GMAC_IMR_PDRQFR		(1 << 22)
/** GMAC_GMAC_IMR_SFT PTP Sync Frame Transmitted **/
#define GMAC_GMAC_IMR_SFT		(1 << 21)
/** GMAC_GMAC_IMR_DRQFT PTP Delay Request Frame Transmitted **/
#define GMAC_GMAC_IMR_DRQFT		(1 << 20)
/** GMAC_GMAC_IMR_SFR PTP Sync Frame Received **/
#define GMAC_GMAC_IMR_SFR		(1 << 19)
/** GMAC_GMAC_IMR_DRQFR PTP Delay Request Frame Received **/
#define GMAC_GMAC_IMR_DRQFR		(1 << 18)
/** GMAC_GMAC_IMR_EXINT External Interrupt **/
#define GMAC_GMAC_IMR_EXINT		(1 << 15)
/** GMAC_GMAC_IMR_PFTR Pause Frame Transmitted **/
#define GMAC_GMAC_IMR_PFTR		(1 << 14)
/** GMAC_GMAC_IMR_PTZ Pause Time Zero **/
#define GMAC_GMAC_IMR_PTZ		(1 << 13)
/** GMAC_GMAC_IMR_PFNZ Pause Frame with Non-zero Pause Quantum Received **/
#define GMAC_GMAC_IMR_PFNZ		(1 << 12)
/** GMAC_GMAC_IMR_HRESP HRESP Not OK **/
#define GMAC_GMAC_IMR_HRESP		(1 << 11)
/** GMAC_GMAC_IMR_ROVR Receive Overrun **/
#define GMAC_GMAC_IMR_ROVR		(1 << 10)
/** GMAC_GMAC_IMR_TCOMP Transmit Complete **/
#define GMAC_GMAC_IMR_TCOMP		(1 << 7)
/** GMAC_GMAC_IMR_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IMR_TFC		(1 << 6)
/** GMAC_GMAC_IMR_RLEX Retry Limit Exceeded **/
#define GMAC_GMAC_IMR_RLEX		(1 << 5)
/** GMAC_GMAC_IMR_TUR Transmit Underrun **/
#define GMAC_GMAC_IMR_TUR		(1 << 4)
/** GMAC_GMAC_IMR_TXUBR TX Used Bit Read **/
#define GMAC_GMAC_IMR_TXUBR		(1 << 3)
/** GMAC_GMAC_IMR_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IMR_RXUBR		(1 << 2)
/** GMAC_GMAC_IMR_RCOMP Receive Complete **/
#define GMAC_GMAC_IMR_RCOMP		(1 << 1)
/** GMAC_GMAC_IMR_MFS Management Frame Sent **/
#define GMAC_GMAC_IMR_MFS		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_man GMACMAN PHY Maintenance Register
@{*/

/** GMAC_GMAC_MAN_WZO Write ZERO **/
#define GMAC_GMAC_MAN_WZO		(1 << 31)
/** GMAC_GMAC_MAN_CLTTO Clause 22 Operation **/
#define GMAC_GMAC_MAN_CLTTO		(1 << 30)

#define GMAC_GMAC_MAN_OP_SHIFT		28
#define GMAC_GMAC_MAN_OP_MASK		0x03
/** @defgroup gmac_gmac_man_op OP Operation
@{*/
/**@}*/


#define GMAC_GMAC_MAN_PHYA_SHIFT		23
#define GMAC_GMAC_MAN_PHYA_MASK		0x1f
/** @defgroup gmac_gmac_man_phya PHYA PHY Address
@{*/
/**@}*/


#define GMAC_GMAC_MAN_REGA_SHIFT		18
#define GMAC_GMAC_MAN_REGA_MASK		0x1f
/** @defgroup gmac_gmac_man_rega REGA Register Address
@{*/
/**@}*/


#define GMAC_GMAC_MAN_WTN_SHIFT		16
#define GMAC_GMAC_MAN_WTN_MASK		0x03
/** @defgroup gmac_gmac_man_wtn WTN Write Ten
@{*/
/**@}*/


#define GMAC_GMAC_MAN_DATA_SHIFT		0
#define GMAC_GMAC_MAN_DATA_MASK		0xffff
/** @defgroup gmac_gmac_man_data DATA PHY Data
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rpq GMACRPQ Received Pause Quantum Register
@{*/


#define GMAC_GMAC_RPQ_RPQ_SHIFT		0
#define GMAC_GMAC_RPQ_RPQ_MASK		0xffff
/** @defgroup gmac_gmac_rpq_rpq RPQ Received Pause Quantum
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tpq GMACTPQ Transmit Pause Quantum Register
@{*/


