grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
#define GMAC_GMAC_TPQ_TPQ_SHIFT		0
#define GMAC_GMAC_TPQ_TPQ_MASK		0xffff
/** @defgroup gmac_gmac_tpq_tpq TPQ Transmit Pause Quantum
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tpsf GMACTPSF TX Partial Store and Forward Register
@{*/

/** GMAC_GMAC_TPSF_ENTXP Enable TX Partial Store and Forward Operation **/
#define GMAC_GMAC_TPSF_ENTXP		(1 << 31)

#define GMAC_GMAC_TPSF_TPB1ADR_SHIFT		0
#define GMAC_GMAC_TPSF_TPB1ADR_MASK		0xfff
/** @defgroup gmac_gmac_tpsf_tpb1adr TPB1ADR Transmit Partial Store and Forward Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rpsf GMACRPSF RX Partial Store and Forward Register
@{*/

/** GMAC_GMAC_RPSF_ENRXP Enable RX Partial Store and Forward Operation **/
#define GMAC_GMAC_RPSF_ENRXP		(1 << 31)

#define GMAC_GMAC_RPSF_RPB1ADR_SHIFT		0
#define GMAC_GMAC_RPSF_RPB1ADR_MASK		0xfff
/** @defgroup gmac_gmac_rpsf_rpb1adr RPB1ADR Receive Partial Store and Forward Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rjfml GMACRJFML RX Jumbo Frame Max Length Register
@{*/


#define GMAC_GMAC_RJFML_FML_SHIFT		0
#define GMAC_GMAC_RJFML_FML_MASK		0x3fff
/** @defgroup gmac_gmac_rjfml_fml FML Frame Max Length
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_hrb GMACHRB Hash Register Bottom
@{*/


#define GMAC_GMAC_HRB_ADDR_SHIFT		0
#define GMAC_GMAC_HRB_ADDR_MASK		0xffffffff
/** @defgroup gmac_gmac_hrb_addr ADDR Hash Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_hrt GMACHRT Hash Register Top
@{*/


#define GMAC_GMAC_HRT_ADDR_SHIFT		0
#define GMAC_GMAC_HRT_ADDR_MASK		0xffffffff
/** @defgroup gmac_gmac_hrt_addr ADDR Hash Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_sa0_gmac_sab GMACSA0GMACSAB Specific Address 1 Bottom Register
@{*/


#define GMAC_GMAC_SA0_GMAC_SAB_ADDR_SHIFT		0
#define GMAC_GMAC_SA0_GMAC_SAB_ADDR_MASK		0xffffffff
/** @defgroup gmac_gmac_sa0_gmac_sab_addr ADDR Specific Address 1
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_sa0_gmac_sat GMACSA0GMACSAT Specific Address 1 Top Register
@{*/


#define GMAC_GMAC_SA0_GMAC_SAT_ADDR_SHIFT		0
#define GMAC_GMAC_SA0_GMAC_SAT_ADDR_MASK		0xffff
/** @defgroup gmac_gmac_sa0_gmac_sat_addr ADDR Specific Address 1
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_sa1_gmac_sab GMACSA1GMACSAB Specific Address 1 Bottom Register
@{*/


#define GMAC_GMAC_SA1_GMAC_SAB_ADDR_SHIFT		0
#define GMAC_GMAC_SA1_GMAC_SAB_ADDR_MASK		0xffffffff
/** @defgroup gmac_gmac_sa1_gmac_sab_addr ADDR Specific Address 1
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_sa1_gmac_sat GMACSA1GMACSAT Specific Address 1 Top Register
@{*/


#define GMAC_GMAC_SA1_GMAC_SAT_ADDR_SHIFT		0
#define GMAC_GMAC_SA1_GMAC_SAT_ADDR_MASK		0xffff
/** @defgroup gmac_gmac_sa1_gmac_sat_addr ADDR Specific Address 1
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_sa2_gmac_sab GMACSA2GMACSAB Specific Address 1 Bottom Register
@{*/


#define GMAC_GMAC_SA2_GMAC_SAB_ADDR_SHIFT		0
#define GMAC_GMAC_SA2_GMAC_SAB_ADDR_MASK		0xffffffff
/** @defgroup gmac_gmac_sa2_gmac_sab_addr ADDR Specific Address 1
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_sa2_gmac_sat GMACSA2GMACSAT Specific Address 1 Top Register
@{*/


#define GMAC_GMAC_SA2_GMAC_SAT_ADDR_SHIFT		0
#define GMAC_GMAC_SA2_GMAC_SAT_ADDR_MASK		0xffff
/** @defgroup gmac_gmac_sa2_gmac_sat_addr ADDR Specific Address 1
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_sa3_gmac_sab GMACSA3GMACSAB Specific Address 1 Bottom Register
@{*/


#define GMAC_GMAC_SA3_GMAC_SAB_ADDR_SHIFT		0
#define GMAC_GMAC_SA3_GMAC_SAB_ADDR_MASK		0xffffffff
/** @defgroup gmac_gmac_sa3_gmac_sab_addr ADDR Specific Address 1
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_sa3_gmac_sat GMACSA3GMACSAT Specific Address 1 Top Register
@{*/


#define GMAC_GMAC_SA3_GMAC_SAT_ADDR_SHIFT		0
#define GMAC_GMAC_SA3_GMAC_SAT_ADDR_MASK		0xffff
/** @defgroup gmac_gmac_sa3_gmac_sat_addr ADDR Specific Address 1
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tidm1 GMACTIDM1 Type ID Match 1 Register
@{*/

/** GMAC_GMAC_TIDM1_ENID1 Enable Copying of TID Matched Frames **/
#define GMAC_GMAC_TIDM1_ENID1		(1 << 31)

#define GMAC_GMAC_TIDM1_TID_SHIFT		0
#define GMAC_GMAC_TIDM1_TID_MASK		0xffff
/** @defgroup gmac_gmac_tidm1_tid TID Type ID Match 1
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tidm2 GMACTIDM2 Type ID Match 2 Register
@{*/

/** GMAC_GMAC_TIDM2_ENID2 Enable Copying of TID Matched Frames **/
#define GMAC_GMAC_TIDM2_ENID2		(1 << 31)

#define GMAC_GMAC_TIDM2_TID_SHIFT		0
#define GMAC_GMAC_TIDM2_TID_MASK		0xffff
/** @defgroup gmac_gmac_tidm2_tid TID Type ID Match 2
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tidm3 GMACTIDM3 Type ID Match 3 Register
@{*/

/** GMAC_GMAC_TIDM3_ENID3 Enable Copying of TID Matched Frames **/
#define GMAC_GMAC_TIDM3_ENID3		(1 << 31)

#define GMAC_GMAC_TIDM3_TID_SHIFT		0
#define GMAC_GMAC_TIDM3_TID_MASK		0xffff
/** @defgroup gmac_gmac_tidm3_tid TID Type ID Match 3
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tidm4 GMACTIDM4 Type ID Match 4 Register
@{*/

/** GMAC_GMAC_TIDM4_ENID4 Enable Copying of TID Matched Frames **/
#define GMAC_GMAC_TIDM4_ENID4		(1 << 31)

#define GMAC_GMAC_TIDM4_TID_SHIFT		0
#define GMAC_GMAC_TIDM4_TID_MASK		0xffff
/** @defgroup gmac_gmac_tidm4_tid TID Type ID Match 4
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_wol GMACWOL Wake on LAN Register
@{*/

/** GMAC_GMAC_WOL_MTI Multicast Hash Event Enable **/
#define GMAC_GMAC_WOL_MTI		(1 << 19)
/** GMAC_GMAC_WOL_SA1 Specific Address Register 1 Event Enable **/
#define GMAC_GMAC_WOL_SA1		(1 << 18)
/** GMAC_GMAC_WOL_ARP ARP Request IP Address **/
#define GMAC_GMAC_WOL_ARP		(1 << 17)
/** GMAC_GMAC_WOL_MAG Magic Packet Event Enable **/
#define GMAC_GMAC_WOL_MAG		(1 << 16)

#define GMAC_GMAC_WOL_IP_SHIFT		0
#define GMAC_GMAC_WOL_IP_MASK		0xffff
/** @defgroup gmac_gmac_wol_ip IP ARP Request IP Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ipgs GMACIPGS IPG Stretch Register
@{*/


#define GMAC_GMAC_IPGS_FL_SHIFT		0
#define GMAC_GMAC_IPGS_FL_MASK		0xffff
/** @defgroup gmac_gmac_ipgs_fl FL Frame Length
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_svlan GMACSVLAN Stacked VLAN Register
@{*/

/** GMAC_GMAC_SVLAN_ESVLAN Enable Stacked VLAN Processing Mode **/
#define GMAC_GMAC_SVLAN_ESVLAN		(1 << 31)

#define GMAC_GMAC_SVLAN_VLAN_TYPE_SHIFT		0
#define GMAC_GMAC_SVLAN_VLAN_TYPE_MASK		0xffff
/** @defgroup gmac_gmac_svlan_vlan_type VLANTYPE User Defined VLAN_TYPE Field
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tpfcp GMACTPFCP Transmit PFC Pause Register
@{*/


#define GMAC_GMAC_TPFCP_PQ_SHIFT		8
#define GMAC_GMAC_TPFCP_PQ_MASK		0xff
/** @defgroup gmac_gmac_tpfcp_pq PQ Pause Quantum
@{*/
/**@}*/


