grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
#define GMAC_GMAC_TPFCP_PEV_SHIFT		0
#define GMAC_GMAC_TPFCP_PEV_MASK		0xff
/** @defgroup gmac_gmac_tpfcp_pev PEV Priority Enable Vector
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_samb1 GMACSAMB1 Specific Address 1 Mask Bottom Register
@{*/


#define GMAC_GMAC_SAMB1_ADDR_SHIFT		0
#define GMAC_GMAC_SAMB1_ADDR_MASK		0xffffffff
/** @defgroup gmac_gmac_samb1_addr ADDR Specific Address 1 Mask
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_samt1 GMACSAMT1 Specific Address 1 Mask Top Register
@{*/


#define GMAC_GMAC_SAMT1_ADDR_SHIFT		0
#define GMAC_GMAC_SAMT1_ADDR_MASK		0xffff
/** @defgroup gmac_gmac_samt1_addr ADDR Specific Address 1 Mask
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_nsc GMACNSC 1588 Timer Nanosecond Comparison Register
@{*/


#define GMAC_GMAC_NSC_NANOSEC_SHIFT		0
#define GMAC_GMAC_NSC_NANOSEC_MASK		0x3fffff
/** @defgroup gmac_gmac_nsc_nanosec NANOSEC 1588 Timer Nanosecond Comparison Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_scl GMACSCL 1588 Timer Second Comparison Low Register
@{*/


#define GMAC_GMAC_SCL_SEC_SHIFT		0
#define GMAC_GMAC_SCL_SEC_MASK		0xffffffff
/** @defgroup gmac_gmac_scl_sec SEC 1588 Timer Second Comparison Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_sch GMACSCH 1588 Timer Second Comparison High Register
@{*/


#define GMAC_GMAC_SCH_SEC_SHIFT		0
#define GMAC_GMAC_SCH_SEC_MASK		0xffff
/** @defgroup gmac_gmac_sch_sec SEC 1588 Timer Second Comparison Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_eftsh GMACEFTSH PTP Event Frame Transmitted Seconds High Register
@{*/


#define GMAC_GMAC_EFTSH_RUD_SHIFT		0
#define GMAC_GMAC_EFTSH_RUD_MASK		0xffff
/** @defgroup gmac_gmac_eftsh_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_efrsh GMACEFRSH PTP Event Frame Received Seconds High Register
@{*/


#define GMAC_GMAC_EFRSH_RUD_SHIFT		0
#define GMAC_GMAC_EFRSH_RUD_MASK		0xffff
/** @defgroup gmac_gmac_efrsh_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_peftsh GMACPEFTSH PTP Peer Event Frame Transmitted Seconds High Register
@{*/


#define GMAC_GMAC_PEFTSH_RUD_SHIFT		0
#define GMAC_GMAC_PEFTSH_RUD_MASK		0xffff
/** @defgroup gmac_gmac_peftsh_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_pefrsh GMACPEFRSH PTP Peer Event Frame Received Seconds High Register
@{*/


#define GMAC_GMAC_PEFRSH_RUD_SHIFT		0
#define GMAC_GMAC_PEFRSH_RUD_MASK		0xffff
/** @defgroup gmac_gmac_pefrsh_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_otlo GMACOTLO Octets Transmitted Low Register
@{*/


#define GMAC_GMAC_OTLO_TXO_SHIFT		0
#define GMAC_GMAC_OTLO_TXO_MASK		0xffffffff
/** @defgroup gmac_gmac_otlo_txo TXO Transmitted Octets
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_othi GMACOTHI Octets Transmitted High Register
@{*/


#define GMAC_GMAC_OTHI_TXO_SHIFT		0
#define GMAC_GMAC_OTHI_TXO_MASK		0xffff
/** @defgroup gmac_gmac_othi_txo TXO Transmitted Octets
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ft GMACFT Frames Transmitted Register
@{*/


#define GMAC_GMAC_FT_FTX_SHIFT		0
#define GMAC_GMAC_FT_FTX_MASK		0xffffffff
/** @defgroup gmac_gmac_ft_ftx FTX Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_bcft GMACBCFT Broadcast Frames Transmitted Register
@{*/


#define GMAC_GMAC_BCFT_BFTX_SHIFT		0
#define GMAC_GMAC_BCFT_BFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_bcft_bftx BFTX Broadcast Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_mft GMACMFT Multicast Frames Transmitted Register
@{*/


#define GMAC_GMAC_MFT_MFTX_SHIFT		0
#define GMAC_GMAC_MFT_MFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_mft_mftx MFTX Multicast Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_pft GMACPFT Pause Frames Transmitted Register
@{*/


#define GMAC_GMAC_PFT_PFTX_SHIFT		0
#define GMAC_GMAC_PFT_PFTX_MASK		0xffff
/** @defgroup gmac_gmac_pft_pftx PFTX Pause Frames Transmitted Register
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_bft64 GMACBFT64 64 Byte Frames Transmitted Register
@{*/


#define GMAC_GMAC_BFT64_NFTX_SHIFT		0
#define GMAC_GMAC_BFT64_NFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_bft64_nftx NFTX 64 Byte Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbft127 GMACTBFT127 65 to 127 Byte Frames Transmitted Register
@{*/


#define GMAC_GMAC_TBFT127_NFTX_SHIFT		0
#define GMAC_GMAC_TBFT127_NFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbft127_nftx NFTX 65 to 127 Byte Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbft255 GMACTBFT255 128 to 255 Byte Frames Transmitted Register
@{*/


#define GMAC_GMAC_TBFT255_NFTX_SHIFT		0
#define GMAC_GMAC_TBFT255_NFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbft255_nftx NFTX 128 to 255 Byte Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbft511 GMACTBFT511 256 to 511 Byte Frames Transmitted Register
@{*/


#define GMAC_GMAC_TBFT511_NFTX_SHIFT		0
#define GMAC_GMAC_TBFT511_NFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbft511_nftx NFTX 256 to 511 Byte Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbft1023 GMACTBFT1023 512 to 1023 Byte Frames Transmitted Register
@{*/


#define GMAC_GMAC_TBFT1023_NFTX_SHIFT		0
#define GMAC_GMAC_TBFT1023_NFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbft1023_nftx NFTX 512 to 1023 Byte Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbft1518 GMACTBFT1518 1024 to 1518 Byte Frames Transmitted Register
@{*/


#define GMAC_GMAC_TBFT1518_NFTX_SHIFT		0
#define GMAC_GMAC_TBFT1518_NFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbft1518_nftx NFTX 1024 to 1518 Byte Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_gtbft1518 GMACGTBFT1518 Greater Than 1518 Byte Frames Transmitted Register
@{*/


#define GMAC_GMAC_GTBFT1518_NFTX_SHIFT		0
#define GMAC_GMAC_GTBFT1518_NFTX_MASK		0xffffffff
/** @defgroup gmac_gmac_gtbft1518_nftx NFTX Greater than 1518 Byte Frames Transmitted without Error
@{*/
/**@}*/


/**@}*/

