grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
/** @defgroup gmac_gmac_tur GMACTUR Transmit Underruns Register
@{*/


#define GMAC_GMAC_TUR_TXUNR_SHIFT		0
#define GMAC_GMAC_TUR_TXUNR_MASK		0x3ff
/** @defgroup gmac_gmac_tur_txunr TXUNR Transmit Underruns
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_scf GMACSCF Single Collision Frames Register
@{*/


#define GMAC_GMAC_SCF_SCOL_SHIFT		0
#define GMAC_GMAC_SCF_SCOL_MASK		0x3ffff
/** @defgroup gmac_gmac_scf_scol SCOL Single Collision
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_mcf GMACMCF Multiple Collision Frames Register
@{*/


#define GMAC_GMAC_MCF_MCOL_SHIFT		0
#define GMAC_GMAC_MCF_MCOL_MASK		0x3ffff
/** @defgroup gmac_gmac_mcf_mcol MCOL Multiple Collision
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ec GMACEC Excessive Collisions Register
@{*/


#define GMAC_GMAC_EC_XCOL_SHIFT		0
#define GMAC_GMAC_EC_XCOL_MASK		0x3ff
/** @defgroup gmac_gmac_ec_xcol XCOL Excessive Collisions
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_lc GMACLC Late Collisions Register
@{*/


#define GMAC_GMAC_LC_LCOL_SHIFT		0
#define GMAC_GMAC_LC_LCOL_MASK		0x3ff
/** @defgroup gmac_gmac_lc_lcol LCOL Late Collisions
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_dtf GMACDTF Deferred Transmission Frames Register
@{*/


#define GMAC_GMAC_DTF_DEFT_SHIFT		0
#define GMAC_GMAC_DTF_DEFT_MASK		0x3ffff
/** @defgroup gmac_gmac_dtf_deft DEFT Deferred Transmission
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_cse GMACCSE Carrier Sense Errors Register
@{*/


#define GMAC_GMAC_CSE_CSR_SHIFT		0
#define GMAC_GMAC_CSE_CSR_MASK		0x3ff
/** @defgroup gmac_gmac_cse_csr CSR Carrier Sense Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_orlo GMACORLO Octets Received Low Received Register
@{*/


#define GMAC_GMAC_ORLO_RXO_SHIFT		0
#define GMAC_GMAC_ORLO_RXO_MASK		0xffffffff
/** @defgroup gmac_gmac_orlo_rxo RXO Received Octets
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_orhi GMACORHI Octets Received High Received Register
@{*/


#define GMAC_GMAC_ORHI_RXO_SHIFT		0
#define GMAC_GMAC_ORHI_RXO_MASK		0xffff
/** @defgroup gmac_gmac_orhi_rxo RXO Received Octets
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_fr GMACFR Frames Received Register
@{*/


#define GMAC_GMAC_FR_FRX_SHIFT		0
#define GMAC_GMAC_FR_FRX_MASK		0xffffffff
/** @defgroup gmac_gmac_fr_frx FRX Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_bcfr GMACBCFR Broadcast Frames Received Register
@{*/


#define GMAC_GMAC_BCFR_BFRX_SHIFT		0
#define GMAC_GMAC_BCFR_BFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_bcfr_bfrx BFRX Broadcast Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_mfr GMACMFR Multicast Frames Received Register
@{*/


#define GMAC_GMAC_MFR_MFRX_SHIFT		0
#define GMAC_GMAC_MFR_MFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_mfr_mfrx MFRX Multicast Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_pfr GMACPFR Pause Frames Received Register
@{*/


#define GMAC_GMAC_PFR_PFRX_SHIFT		0
#define GMAC_GMAC_PFR_PFRX_MASK		0xffff
/** @defgroup gmac_gmac_pfr_pfrx PFRX Pause Frames Received Register
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_bfr64 GMACBFR64 64 Byte Frames Received Register
@{*/


#define GMAC_GMAC_BFR64_NFRX_SHIFT		0
#define GMAC_GMAC_BFR64_NFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_bfr64_nfrx NFRX 64 Byte Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbfr127 GMACTBFR127 65 to 127 Byte Frames Received Register
@{*/


#define GMAC_GMAC_TBFR127_NFRX_SHIFT		0
#define GMAC_GMAC_TBFR127_NFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbfr127_nfrx NFRX 65 to 127 Byte Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbfr255 GMACTBFR255 128 to 255 Byte Frames Received Register
@{*/


#define GMAC_GMAC_TBFR255_NFRX_SHIFT		0
#define GMAC_GMAC_TBFR255_NFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbfr255_nfrx NFRX 128 to 255 Byte Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbfr511 GMACTBFR511 256 to 511 Byte Frames Received Register
@{*/


#define GMAC_GMAC_TBFR511_NFRX_SHIFT		0
#define GMAC_GMAC_TBFR511_NFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbfr511_nfrx NFRX 256 to 511 Byte Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbfr1023 GMACTBFR1023 512 to 1023 Byte Frames Received Register
@{*/


#define GMAC_GMAC_TBFR1023_NFRX_SHIFT		0
#define GMAC_GMAC_TBFR1023_NFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbfr1023_nfrx NFRX 512 to 1023 Byte Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbfr1518 GMACTBFR1518 1024 to 1518 Byte Frames Received Register
@{*/


#define GMAC_GMAC_TBFR1518_NFRX_SHIFT		0
#define GMAC_GMAC_TBFR1518_NFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_tbfr1518_nfrx NFRX 1024 to 1518 Byte Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tmxbfr GMACTMXBFR 1519 to Maximum Byte Frames Received Register
@{*/


#define GMAC_GMAC_TMXBFR_NFRX_SHIFT		0
#define GMAC_GMAC_TMXBFR_NFRX_MASK		0xffffffff
/** @defgroup gmac_gmac_tmxbfr_nfrx NFRX 1519 to Maximum Byte Frames Received without Error
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ufr GMACUFR Undersize Frames Received Register
@{*/


#define GMAC_GMAC_UFR_UFRX_SHIFT		0
#define GMAC_GMAC_UFR_UFRX_MASK		0x3ff
/** @defgroup gmac_gmac_ufr_ufrx UFRX Undersize Frames Received
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ofr GMACOFR Oversize Frames Received Register
@{*/


#define GMAC_GMAC_OFR_OFRX_SHIFT		0
#define GMAC_GMAC_OFR_OFRX_MASK		0x3ff
/** @defgroup gmac_gmac_ofr_ofrx OFRX Oversized Frames Received
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_jr GMACJR Jabbers Received Register
@{*/


#define GMAC_GMAC_JR_JRX_SHIFT		0
#define GMAC_GMAC_JR_JRX_MASK		0x3ff
/** @defgroup gmac_gmac_jr_jrx JRX Jabbers Received
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_fcse GMACFCSE Frame Check Sequence Errors Register
@{*/


#define GMAC_GMAC_FCSE_FCKR_SHIFT		0
#define GMAC_GMAC_FCSE_FCKR_MASK		0x3ff
/** @defgroup gmac_gmac_fcse_fckr FCKR Frame Check Sequence Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_lffe GMACLFFE Length Field Frame Errors Register
@{*/


#define GMAC_GMAC_LFFE_LFER_SHIFT		0
#define GMAC_GMAC_LFFE_LFER_MASK		0x3ff
/** @defgroup gmac_gmac_lffe_lfer LFER Length Field Frame Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rse GMACRSE Receive Symbol Errors Register
@{*/


#define GMAC_GMAC_RSE_RXSE_SHIFT		0
#define GMAC_GMAC_RSE_RXSE_MASK		0x3ff
/** @defgroup gmac_gmac_rse_rxse RXSE Receive Symbol Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ae GMACAE Alignment Errors Register
@{*/


#define GMAC_GMAC_AE_AER_SHIFT		0
#define GMAC_GMAC_AE_AER_MASK		0x3ff
/** @defgroup gmac_gmac_ae_aer AER Alignment Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rre GMACRRE Receive Resource Errors Register
@{*/


#define GMAC_GMAC_RRE_RXRER_SHIFT		0
#define GMAC_GMAC_RRE_RXRER_MASK		0x3ffff
/** @defgroup gmac_gmac_rre_rxrer RXRER Receive Resource Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_roe GMACROE Receive Overrun Register
@{*/


