grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
#define GMAC_GMAC_ROE_RXOVR_SHIFT		0
#define GMAC_GMAC_ROE_RXOVR_MASK		0x3ff
/** @defgroup gmac_gmac_roe_rxovr RXOVR Receive Overruns
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ihce GMACIHCE IP Header Checksum Errors Register
@{*/


#define GMAC_GMAC_IHCE_HCKER_SHIFT		0
#define GMAC_GMAC_IHCE_HCKER_MASK		0xff
/** @defgroup gmac_gmac_ihce_hcker HCKER IP Header Checksum Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tce GMACTCE TCP Checksum Errors Register
@{*/


#define GMAC_GMAC_TCE_TCKER_SHIFT		0
#define GMAC_GMAC_TCE_TCKER_MASK		0xff
/** @defgroup gmac_gmac_tce_tcker TCKER TCP Checksum Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_uce GMACUCE UDP Checksum Errors Register
@{*/


#define GMAC_GMAC_UCE_UCKER_SHIFT		0
#define GMAC_GMAC_UCE_UCKER_MASK		0xff
/** @defgroup gmac_gmac_uce_ucker UCKER UDP Checksum Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tisubn GMACTISUBN 1588 Timer Increment Sub-nanoseconds Register
@{*/


#define GMAC_GMAC_TISUBN_LSBTIR_SHIFT		0
#define GMAC_GMAC_TISUBN_LSBTIR_MASK		0xffff
/** @defgroup gmac_gmac_tisubn_lsbtir LSBTIR Lower Significant Bits of Timer Increment Register
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tsh GMACTSH 1588 Timer Seconds High Register
@{*/


#define GMAC_GMAC_TSH_TCS_SHIFT		0
#define GMAC_GMAC_TSH_TCS_MASK		0xffff
/** @defgroup gmac_gmac_tsh_tcs TCS Timer Count in Seconds
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tsl GMACTSL 1588 Timer Seconds Low Register
@{*/


#define GMAC_GMAC_TSL_TCS_SHIFT		0
#define GMAC_GMAC_TSL_TCS_MASK		0xffffffff
/** @defgroup gmac_gmac_tsl_tcs TCS Timer Count in Seconds
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tn GMACTN 1588 Timer Nanoseconds Register
@{*/


#define GMAC_GMAC_TN_TNS_SHIFT		0
#define GMAC_GMAC_TN_TNS_MASK		0x3fffffff
/** @defgroup gmac_gmac_tn_tns TNS Timer Count in Nanoseconds
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ta GMACTA 1588 Timer Adjust Register
@{*/

/** GMAC_GMAC_TA_ADJ Adjust 1588 Timer **/
#define GMAC_GMAC_TA_ADJ		(1 << 31)

#define GMAC_GMAC_TA_ITDT_SHIFT		0
#define GMAC_GMAC_TA_ITDT_MASK		0x3fffffff
/** @defgroup gmac_gmac_ta_itdt ITDT Increment/Decrement
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ti GMACTI 1588 Timer Increment Register
@{*/


#define GMAC_GMAC_TI_NIT_SHIFT		16
#define GMAC_GMAC_TI_NIT_MASK		0xff
/** @defgroup gmac_gmac_ti_nit NIT Number of Increments
@{*/
/**@}*/


#define GMAC_GMAC_TI_ACNS_SHIFT		8
#define GMAC_GMAC_TI_ACNS_MASK		0xff
/** @defgroup gmac_gmac_ti_acns ACNS Alternative Count Nanoseconds
@{*/
/**@}*/


#define GMAC_GMAC_TI_CNS_SHIFT		0
#define GMAC_GMAC_TI_CNS_MASK		0xff
/** @defgroup gmac_gmac_ti_cns CNS Count Nanoseconds
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_eftsl GMACEFTSL PTP Event Frame Transmitted Seconds Low Register
@{*/


#define GMAC_GMAC_EFTSL_RUD_SHIFT		0
#define GMAC_GMAC_EFTSL_RUD_MASK		0xffffffff
/** @defgroup gmac_gmac_eftsl_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_eftn GMACEFTN PTP Event Frame Transmitted Nanoseconds Register
@{*/


#define GMAC_GMAC_EFTN_RUD_SHIFT		0
#define GMAC_GMAC_EFTN_RUD_MASK		0x3fffffff
/** @defgroup gmac_gmac_eftn_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_efrsl GMACEFRSL PTP Event Frame Received Seconds Low Register
@{*/


#define GMAC_GMAC_EFRSL_RUD_SHIFT		0
#define GMAC_GMAC_EFRSL_RUD_MASK		0xffffffff
/** @defgroup gmac_gmac_efrsl_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_efrn GMACEFRN PTP Event Frame Received Nanoseconds Register
@{*/


#define GMAC_GMAC_EFRN_RUD_SHIFT		0
#define GMAC_GMAC_EFRN_RUD_MASK		0x3fffffff
/** @defgroup gmac_gmac_efrn_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_peftsl GMACPEFTSL PTP Peer Event Frame Transmitted Seconds Low Register
@{*/


#define GMAC_GMAC_PEFTSL_RUD_SHIFT		0
#define GMAC_GMAC_PEFTSL_RUD_MASK		0xffffffff
/** @defgroup gmac_gmac_peftsl_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_peftn GMACPEFTN PTP Peer Event Frame Transmitted Nanoseconds Register
@{*/


#define GMAC_GMAC_PEFTN_RUD_SHIFT		0
#define GMAC_GMAC_PEFTN_RUD_MASK		0x3fffffff
/** @defgroup gmac_gmac_peftn_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_pefrsl GMACPEFRSL PTP Peer Event Frame Received Seconds Low Register
@{*/


#define GMAC_GMAC_PEFRSL_RUD_SHIFT		0
#define GMAC_GMAC_PEFRSL_RUD_MASK		0xffffffff
/** @defgroup gmac_gmac_pefrsl_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_pefrn GMACPEFRN PTP Peer Event Frame Received Nanoseconds Register
@{*/


#define GMAC_GMAC_PEFRN_RUD_SHIFT		0
#define GMAC_GMAC_PEFRN_RUD_MASK		0x3fffffff
/** @defgroup gmac_gmac_pefrn_rud RUD Register Update
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rxlpi GMACRXLPI Received LPI Transitions
@{*/


#define GMAC_GMAC_RXLPI_COUNT_SHIFT		0
#define GMAC_GMAC_RXLPI_COUNT_MASK		0xffff
/** @defgroup gmac_gmac_rxlpi_count COUNT Count of RX LPI transitions (cleared on read)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rxlpitime GMACRXLPITIME Received LPI Time
@{*/


#define GMAC_GMAC_RXLPITIME_LPITIME_SHIFT		0
#define GMAC_GMAC_RXLPITIME_LPITIME_MASK		0xffffff
/** @defgroup gmac_gmac_rxlpitime_lpitime LPITIME Time in LPI (cleared on read)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_txlpi GMACTXLPI Transmit LPI Transitions
@{*/


#define GMAC_GMAC_TXLPI_COUNT_SHIFT		0
#define GMAC_GMAC_TXLPI_COUNT_MASK		0xffff
/** @defgroup gmac_gmac_txlpi_count COUNT Count of LPI transitions (cleared on read)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_txlpitime GMACTXLPITIME Transmit LPI Time
@{*/


#define GMAC_GMAC_TXLPITIME_LPITIME_SHIFT		0
#define GMAC_GMAC_TXLPITIME_LPITIME_MASK		0xffffff
/** @defgroup gmac_gmac_txlpitime_lpitime LPITIME Time in LPI (cleared on read)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_isrpq[0] GMACISRPQ[0] Interrupt Status Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_ISRPQ[0]_HRESP HRESP Not OK **/
#define GMAC_GMAC_ISRPQ[0]_HRESP		(1 << 11)
/** GMAC_GMAC_ISRPQ[0]_ROVR Receive Overrun **/
#define GMAC_GMAC_ISRPQ[0]_ROVR		(1 << 10)
/** GMAC_GMAC_ISRPQ[0]_TCOMP Transmit Complete **/
#define GMAC_GMAC_ISRPQ[0]_TCOMP		(1 << 7)
/** GMAC_GMAC_ISRPQ[0]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_ISRPQ[0]_TFC		(1 << 6)
/** GMAC_GMAC_ISRPQ[0]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_ISRPQ[0]_RLEX		(1 << 5)
/** GMAC_GMAC_ISRPQ[0]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_ISRPQ[0]_RXUBR		(1 << 2)
/** GMAC_GMAC_ISRPQ[0]_RCOMP Receive Complete **/
#define GMAC_GMAC_ISRPQ[0]_RCOMP		(1 << 1)

/**@}*/

