grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
/** @defgroup gmac_gmac_isrpq[1] GMACISRPQ[1] Interrupt Status Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_ISRPQ[1]_HRESP HRESP Not OK **/
#define GMAC_GMAC_ISRPQ[1]_HRESP		(1 << 11)
/** GMAC_GMAC_ISRPQ[1]_ROVR Receive Overrun **/
#define GMAC_GMAC_ISRPQ[1]_ROVR		(1 << 10)
/** GMAC_GMAC_ISRPQ[1]_TCOMP Transmit Complete **/
#define GMAC_GMAC_ISRPQ[1]_TCOMP		(1 << 7)
/** GMAC_GMAC_ISRPQ[1]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_ISRPQ[1]_TFC		(1 << 6)
/** GMAC_GMAC_ISRPQ[1]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_ISRPQ[1]_RLEX		(1 << 5)
/** GMAC_GMAC_ISRPQ[1]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_ISRPQ[1]_RXUBR		(1 << 2)
/** GMAC_GMAC_ISRPQ[1]_RCOMP Receive Complete **/
#define GMAC_GMAC_ISRPQ[1]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_isrpq[2] GMACISRPQ[2] Interrupt Status Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_ISRPQ[2]_HRESP HRESP Not OK **/
#define GMAC_GMAC_ISRPQ[2]_HRESP		(1 << 11)
/** GMAC_GMAC_ISRPQ[2]_ROVR Receive Overrun **/
#define GMAC_GMAC_ISRPQ[2]_ROVR		(1 << 10)
/** GMAC_GMAC_ISRPQ[2]_TCOMP Transmit Complete **/
#define GMAC_GMAC_ISRPQ[2]_TCOMP		(1 << 7)
/** GMAC_GMAC_ISRPQ[2]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_ISRPQ[2]_TFC		(1 << 6)
/** GMAC_GMAC_ISRPQ[2]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_ISRPQ[2]_RLEX		(1 << 5)
/** GMAC_GMAC_ISRPQ[2]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_ISRPQ[2]_RXUBR		(1 << 2)
/** GMAC_GMAC_ISRPQ[2]_RCOMP Receive Complete **/
#define GMAC_GMAC_ISRPQ[2]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_isrpq[3] GMACISRPQ[3] Interrupt Status Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_ISRPQ[3]_HRESP HRESP Not OK **/
#define GMAC_GMAC_ISRPQ[3]_HRESP		(1 << 11)
/** GMAC_GMAC_ISRPQ[3]_ROVR Receive Overrun **/
#define GMAC_GMAC_ISRPQ[3]_ROVR		(1 << 10)
/** GMAC_GMAC_ISRPQ[3]_TCOMP Transmit Complete **/
#define GMAC_GMAC_ISRPQ[3]_TCOMP		(1 << 7)
/** GMAC_GMAC_ISRPQ[3]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_ISRPQ[3]_TFC		(1 << 6)
/** GMAC_GMAC_ISRPQ[3]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_ISRPQ[3]_RLEX		(1 << 5)
/** GMAC_GMAC_ISRPQ[3]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_ISRPQ[3]_RXUBR		(1 << 2)
/** GMAC_GMAC_ISRPQ[3]_RCOMP Receive Complete **/
#define GMAC_GMAC_ISRPQ[3]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_isrpq[4] GMACISRPQ[4] Interrupt Status Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_ISRPQ[4]_HRESP HRESP Not OK **/
#define GMAC_GMAC_ISRPQ[4]_HRESP		(1 << 11)
/** GMAC_GMAC_ISRPQ[4]_ROVR Receive Overrun **/
#define GMAC_GMAC_ISRPQ[4]_ROVR		(1 << 10)
/** GMAC_GMAC_ISRPQ[4]_TCOMP Transmit Complete **/
#define GMAC_GMAC_ISRPQ[4]_TCOMP		(1 << 7)
/** GMAC_GMAC_ISRPQ[4]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_ISRPQ[4]_TFC		(1 << 6)
/** GMAC_GMAC_ISRPQ[4]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_ISRPQ[4]_RLEX		(1 << 5)
/** GMAC_GMAC_ISRPQ[4]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_ISRPQ[4]_RXUBR		(1 << 2)
/** GMAC_GMAC_ISRPQ[4]_RCOMP Receive Complete **/
#define GMAC_GMAC_ISRPQ[4]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_tbqbapq[0] GMACTBQBAPQ[0] Transmit Buffer Queue Base Address Register Priority Queue (1..5)
@{*/


#define GMAC_GMAC_TBQBAPQ[0]_TXBQBA_SHIFT		2
#define GMAC_GMAC_TBQBAPQ[0]_TXBQBA_MASK		0x3fffffff
/** @defgroup gmac_gmac_tbqbapq[0]_txbqba TXBQBA Transmit Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbqbapq[1] GMACTBQBAPQ[1] Transmit Buffer Queue Base Address Register Priority Queue (1..5)
@{*/


#define GMAC_GMAC_TBQBAPQ[1]_TXBQBA_SHIFT		2
#define GMAC_GMAC_TBQBAPQ[1]_TXBQBA_MASK		0x3fffffff
/** @defgroup gmac_gmac_tbqbapq[1]_txbqba TXBQBA Transmit Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbqbapq[2] GMACTBQBAPQ[2] Transmit Buffer Queue Base Address Register Priority Queue (1..5)
@{*/


#define GMAC_GMAC_TBQBAPQ[2]_TXBQBA_SHIFT		2
#define GMAC_GMAC_TBQBAPQ[2]_TXBQBA_MASK		0x3fffffff
/** @defgroup gmac_gmac_tbqbapq[2]_txbqba TXBQBA Transmit Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbqbapq[3] GMACTBQBAPQ[3] Transmit Buffer Queue Base Address Register Priority Queue (1..5)
@{*/


#define GMAC_GMAC_TBQBAPQ[3]_TXBQBA_SHIFT		2
#define GMAC_GMAC_TBQBAPQ[3]_TXBQBA_MASK		0x3fffffff
/** @defgroup gmac_gmac_tbqbapq[3]_txbqba TXBQBA Transmit Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_tbqbapq[4] GMACTBQBAPQ[4] Transmit Buffer Queue Base Address Register Priority Queue (1..5)
@{*/


#define GMAC_GMAC_TBQBAPQ[4]_TXBQBA_SHIFT		2
#define GMAC_GMAC_TBQBAPQ[4]_TXBQBA_MASK		0x3fffffff
/** @defgroup gmac_gmac_tbqbapq[4]_txbqba TXBQBA Transmit Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rbqbapq[0] GMACRBQBAPQ[0] Receive Buffer Queue Base Address Register Priority Queue (1..5)
@{*/


#define GMAC_GMAC_RBQBAPQ[0]_RXBQBA_SHIFT		2
#define GMAC_GMAC_RBQBAPQ[0]_RXBQBA_MASK		0x3fffffff
/** @defgroup gmac_gmac_rbqbapq[0]_rxbqba RXBQBA Receive Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rbqbapq[1] GMACRBQBAPQ[1] Receive Buffer Queue Base Address Register Priority Queue (1..5)
@{*/


#define GMAC_GMAC_RBQBAPQ[1]_RXBQBA_SHIFT		2
#define GMAC_GMAC_RBQBAPQ[1]_RXBQBA_MASK		0x3fffffff
/** @defgroup gmac_gmac_rbqbapq[1]_rxbqba RXBQBA Receive Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rbqbapq[2] GMACRBQBAPQ[2] Receive Buffer Queue Base Address Register Priority Queue (1..5)
@{*/


#define GMAC_GMAC_RBQBAPQ[2]_RXBQBA_SHIFT		2
#define GMAC_GMAC_RBQBAPQ[2]_RXBQBA_MASK		0x3fffffff
/** @defgroup gmac_gmac_rbqbapq[2]_rxbqba RXBQBA Receive Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rbqbapq[3] GMACRBQBAPQ[3] Receive Buffer Queue Base Address Register Priority Queue (1..5)
@{*/


#define GMAC_GMAC_RBQBAPQ[3]_RXBQBA_SHIFT		2
#define GMAC_GMAC_RBQBAPQ[3]_RXBQBA_MASK		0x3fffffff
/** @defgroup gmac_gmac_rbqbapq[3]_rxbqba RXBQBA Receive Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rbqbapq[4] GMACRBQBAPQ[4] Receive Buffer Queue Base Address Register Priority Queue (1..5)
@{*/


#define GMAC_GMAC_RBQBAPQ[4]_RXBQBA_SHIFT		2
#define GMAC_GMAC_RBQBAPQ[4]_RXBQBA_MASK		0x3fffffff
/** @defgroup gmac_gmac_rbqbapq[4]_rxbqba RXBQBA Receive Buffer Queue Base Address
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rbsrpq[0] GMACRBSRPQ[0] Receive Buffer Size Register Priority Queue (1..5)
@{*/


#define GMAC_GMAC_RBSRPQ[0]_RBS_SHIFT		0
#define GMAC_GMAC_RBSRPQ[0]_RBS_MASK		0xffff
/** @defgroup gmac_gmac_rbsrpq[0]_rbs RBS Receive Buffer Size
@{*/
/**@}*/


/**@}*/

