grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
/** @defgroup gmac_gmac_rbsrpq[1] GMACRBSRPQ[1] Receive Buffer Size Register Priority Queue (1..5)
@{*/


#define GMAC_GMAC_RBSRPQ[1]_RBS_SHIFT		0
#define GMAC_GMAC_RBSRPQ[1]_RBS_MASK		0xffff
/** @defgroup gmac_gmac_rbsrpq[1]_rbs RBS Receive Buffer Size
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rbsrpq[2] GMACRBSRPQ[2] Receive Buffer Size Register Priority Queue (1..5)
@{*/


#define GMAC_GMAC_RBSRPQ[2]_RBS_SHIFT		0
#define GMAC_GMAC_RBSRPQ[2]_RBS_MASK		0xffff
/** @defgroup gmac_gmac_rbsrpq[2]_rbs RBS Receive Buffer Size
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rbsrpq[3] GMACRBSRPQ[3] Receive Buffer Size Register Priority Queue (1..5)
@{*/


#define GMAC_GMAC_RBSRPQ[3]_RBS_SHIFT		0
#define GMAC_GMAC_RBSRPQ[3]_RBS_MASK		0xffff
/** @defgroup gmac_gmac_rbsrpq[3]_rbs RBS Receive Buffer Size
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_rbsrpq[4] GMACRBSRPQ[4] Receive Buffer Size Register Priority Queue (1..5)
@{*/


#define GMAC_GMAC_RBSRPQ[4]_RBS_SHIFT		0
#define GMAC_GMAC_RBSRPQ[4]_RBS_MASK		0xffff
/** @defgroup gmac_gmac_rbsrpq[4]_rbs RBS Receive Buffer Size
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_cbscr GMACCBSCR Credit-Based Shaping Control Register
@{*/

/** GMAC_GMAC_CBSCR_QAE Queue A CBS Enable **/
#define GMAC_GMAC_CBSCR_QAE		(1 << 1)
/** GMAC_GMAC_CBSCR_QBE Queue B CBS Enable **/
#define GMAC_GMAC_CBSCR_QBE		(1 << 0)

/**@}*/

/** @defgroup gmac_gmac_cbsisqa GMACCBSISQA Credit-Based Shaping IdleSlope Register for Queue A
@{*/


#define GMAC_GMAC_CBSISQA_IS_SHIFT		0
#define GMAC_GMAC_CBSISQA_IS_MASK		0xffffffff
/** @defgroup gmac_gmac_cbsisqa_is IS IdleSlope
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_cbsisqb GMACCBSISQB Credit-Based Shaping IdleSlope Register for Queue B
@{*/


#define GMAC_GMAC_CBSISQB_IS_SHIFT		0
#define GMAC_GMAC_CBSISQB_IS_MASK		0xffffffff
/** @defgroup gmac_gmac_cbsisqb_is IS IdleSlope
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st1rpq[0] GMACST1RPQ[0] Screening Type 1 Register Priority Queue
@{*/

/** GMAC_GMAC_ST1RPQ[0]_UDPE UDP Port Match Enable **/
#define GMAC_GMAC_ST1RPQ[0]_UDPE		(1 << 29)
/** GMAC_GMAC_ST1RPQ[0]_DSTCE Differentiated Services or Traffic Class Match Enable **/
#define GMAC_GMAC_ST1RPQ[0]_DSTCE		(1 << 28)

#define GMAC_GMAC_ST1RPQ[0]_UDPM_SHIFT		12
#define GMAC_GMAC_ST1RPQ[0]_UDPM_MASK		0xffff
/** @defgroup gmac_gmac_st1rpq[0]_udpm UDPM UDP Port Match
@{*/
/**@}*/


#define GMAC_GMAC_ST1RPQ[0]_DSTCM_SHIFT		4
#define GMAC_GMAC_ST1RPQ[0]_DSTCM_MASK		0xff
/** @defgroup gmac_gmac_st1rpq[0]_dstcm DSTCM Differentiated Services or Traffic Class Match
@{*/
/**@}*/


#define GMAC_GMAC_ST1RPQ[0]_QNB_SHIFT		0
#define GMAC_GMAC_ST1RPQ[0]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st1rpq[0]_qnb QNB Queue Number (0-5)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st1rpq[1] GMACST1RPQ[1] Screening Type 1 Register Priority Queue
@{*/

/** GMAC_GMAC_ST1RPQ[1]_UDPE UDP Port Match Enable **/
#define GMAC_GMAC_ST1RPQ[1]_UDPE		(1 << 29)
/** GMAC_GMAC_ST1RPQ[1]_DSTCE Differentiated Services or Traffic Class Match Enable **/
#define GMAC_GMAC_ST1RPQ[1]_DSTCE		(1 << 28)

#define GMAC_GMAC_ST1RPQ[1]_UDPM_SHIFT		12
#define GMAC_GMAC_ST1RPQ[1]_UDPM_MASK		0xffff
/** @defgroup gmac_gmac_st1rpq[1]_udpm UDPM UDP Port Match
@{*/
/**@}*/


#define GMAC_GMAC_ST1RPQ[1]_DSTCM_SHIFT		4
#define GMAC_GMAC_ST1RPQ[1]_DSTCM_MASK		0xff
/** @defgroup gmac_gmac_st1rpq[1]_dstcm DSTCM Differentiated Services or Traffic Class Match
@{*/
/**@}*/


#define GMAC_GMAC_ST1RPQ[1]_QNB_SHIFT		0
#define GMAC_GMAC_ST1RPQ[1]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st1rpq[1]_qnb QNB Queue Number (0-5)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st1rpq[2] GMACST1RPQ[2] Screening Type 1 Register Priority Queue
@{*/

/** GMAC_GMAC_ST1RPQ[2]_UDPE UDP Port Match Enable **/
#define GMAC_GMAC_ST1RPQ[2]_UDPE		(1 << 29)
/** GMAC_GMAC_ST1RPQ[2]_DSTCE Differentiated Services or Traffic Class Match Enable **/
#define GMAC_GMAC_ST1RPQ[2]_DSTCE		(1 << 28)

#define GMAC_GMAC_ST1RPQ[2]_UDPM_SHIFT		12
#define GMAC_GMAC_ST1RPQ[2]_UDPM_MASK		0xffff
/** @defgroup gmac_gmac_st1rpq[2]_udpm UDPM UDP Port Match
@{*/
/**@}*/


#define GMAC_GMAC_ST1RPQ[2]_DSTCM_SHIFT		4
#define GMAC_GMAC_ST1RPQ[2]_DSTCM_MASK		0xff
/** @defgroup gmac_gmac_st1rpq[2]_dstcm DSTCM Differentiated Services or Traffic Class Match
@{*/
/**@}*/


#define GMAC_GMAC_ST1RPQ[2]_QNB_SHIFT		0
#define GMAC_GMAC_ST1RPQ[2]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st1rpq[2]_qnb QNB Queue Number (0-5)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st1rpq[3] GMACST1RPQ[3] Screening Type 1 Register Priority Queue
@{*/

/** GMAC_GMAC_ST1RPQ[3]_UDPE UDP Port Match Enable **/
#define GMAC_GMAC_ST1RPQ[3]_UDPE		(1 << 29)
/** GMAC_GMAC_ST1RPQ[3]_DSTCE Differentiated Services or Traffic Class Match Enable **/
#define GMAC_GMAC_ST1RPQ[3]_DSTCE		(1 << 28)

#define GMAC_GMAC_ST1RPQ[3]_UDPM_SHIFT		12
#define GMAC_GMAC_ST1RPQ[3]_UDPM_MASK		0xffff
/** @defgroup gmac_gmac_st1rpq[3]_udpm UDPM UDP Port Match
@{*/
/**@}*/


#define GMAC_GMAC_ST1RPQ[3]_DSTCM_SHIFT		4
#define GMAC_GMAC_ST1RPQ[3]_DSTCM_MASK		0xff
/** @defgroup gmac_gmac_st1rpq[3]_dstcm DSTCM Differentiated Services or Traffic Class Match
@{*/
/**@}*/


#define GMAC_GMAC_ST1RPQ[3]_QNB_SHIFT		0
#define GMAC_GMAC_ST1RPQ[3]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st1rpq[3]_qnb QNB Queue Number (0-5)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2rpq[0] GMACST2RPQ[0] Screening Type 2 Register Priority Queue
@{*/

/** GMAC_GMAC_ST2RPQ[0]_COMPCE Compare C Enable **/
#define GMAC_GMAC_ST2RPQ[0]_COMPCE		(1 << 30)

#define GMAC_GMAC_ST2RPQ[0]_COMPC_SHIFT		25
#define GMAC_GMAC_ST2RPQ[0]_COMPC_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[0]_compc COMPC Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[0]_COMPBE Compare B Enable **/
#define GMAC_GMAC_ST2RPQ[0]_COMPBE		(1 << 24)

#define GMAC_GMAC_ST2RPQ[0]_COMPB_SHIFT		19
#define GMAC_GMAC_ST2RPQ[0]_COMPB_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[0]_compb COMPB Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

