grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
/** GMAC_GMAC_ST2RPQ[0]_COMPAE Compare A Enable **/
#define GMAC_GMAC_ST2RPQ[0]_COMPAE		(1 << 18)

#define GMAC_GMAC_ST2RPQ[0]_COMPA_SHIFT		13
#define GMAC_GMAC_ST2RPQ[0]_COMPA_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[0]_compa COMPA Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[0]_ETHE EtherType Enable **/
#define GMAC_GMAC_ST2RPQ[0]_ETHE		(1 << 12)

#define GMAC_GMAC_ST2RPQ[0]_I2ETH_SHIFT		9
#define GMAC_GMAC_ST2RPQ[0]_I2ETH_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[0]_i2eth I2ETH Index of Screening Type 2 EtherType register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[0]_VLANE VLAN Enable **/
#define GMAC_GMAC_ST2RPQ[0]_VLANE		(1 << 8)

#define GMAC_GMAC_ST2RPQ[0]_VLANP_SHIFT		4
#define GMAC_GMAC_ST2RPQ[0]_VLANP_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[0]_vlanp VLANP VLAN Priority
@{*/
/**@}*/


#define GMAC_GMAC_ST2RPQ[0]_QNB_SHIFT		0
#define GMAC_GMAC_ST2RPQ[0]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[0]_qnb QNB Queue Number (0-5)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2rpq[1] GMACST2RPQ[1] Screening Type 2 Register Priority Queue
@{*/

/** GMAC_GMAC_ST2RPQ[1]_COMPCE Compare C Enable **/
#define GMAC_GMAC_ST2RPQ[1]_COMPCE		(1 << 30)

#define GMAC_GMAC_ST2RPQ[1]_COMPC_SHIFT		25
#define GMAC_GMAC_ST2RPQ[1]_COMPC_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[1]_compc COMPC Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[1]_COMPBE Compare B Enable **/
#define GMAC_GMAC_ST2RPQ[1]_COMPBE		(1 << 24)

#define GMAC_GMAC_ST2RPQ[1]_COMPB_SHIFT		19
#define GMAC_GMAC_ST2RPQ[1]_COMPB_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[1]_compb COMPB Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[1]_COMPAE Compare A Enable **/
#define GMAC_GMAC_ST2RPQ[1]_COMPAE		(1 << 18)

#define GMAC_GMAC_ST2RPQ[1]_COMPA_SHIFT		13
#define GMAC_GMAC_ST2RPQ[1]_COMPA_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[1]_compa COMPA Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[1]_ETHE EtherType Enable **/
#define GMAC_GMAC_ST2RPQ[1]_ETHE		(1 << 12)

#define GMAC_GMAC_ST2RPQ[1]_I2ETH_SHIFT		9
#define GMAC_GMAC_ST2RPQ[1]_I2ETH_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[1]_i2eth I2ETH Index of Screening Type 2 EtherType register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[1]_VLANE VLAN Enable **/
#define GMAC_GMAC_ST2RPQ[1]_VLANE		(1 << 8)

#define GMAC_GMAC_ST2RPQ[1]_VLANP_SHIFT		4
#define GMAC_GMAC_ST2RPQ[1]_VLANP_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[1]_vlanp VLANP VLAN Priority
@{*/
/**@}*/


#define GMAC_GMAC_ST2RPQ[1]_QNB_SHIFT		0
#define GMAC_GMAC_ST2RPQ[1]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[1]_qnb QNB Queue Number (0-5)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2rpq[2] GMACST2RPQ[2] Screening Type 2 Register Priority Queue
@{*/

/** GMAC_GMAC_ST2RPQ[2]_COMPCE Compare C Enable **/
#define GMAC_GMAC_ST2RPQ[2]_COMPCE		(1 << 30)

#define GMAC_GMAC_ST2RPQ[2]_COMPC_SHIFT		25
#define GMAC_GMAC_ST2RPQ[2]_COMPC_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[2]_compc COMPC Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[2]_COMPBE Compare B Enable **/
#define GMAC_GMAC_ST2RPQ[2]_COMPBE		(1 << 24)

#define GMAC_GMAC_ST2RPQ[2]_COMPB_SHIFT		19
#define GMAC_GMAC_ST2RPQ[2]_COMPB_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[2]_compb COMPB Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[2]_COMPAE Compare A Enable **/
#define GMAC_GMAC_ST2RPQ[2]_COMPAE		(1 << 18)

#define GMAC_GMAC_ST2RPQ[2]_COMPA_SHIFT		13
#define GMAC_GMAC_ST2RPQ[2]_COMPA_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[2]_compa COMPA Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[2]_ETHE EtherType Enable **/
#define GMAC_GMAC_ST2RPQ[2]_ETHE		(1 << 12)

#define GMAC_GMAC_ST2RPQ[2]_I2ETH_SHIFT		9
#define GMAC_GMAC_ST2RPQ[2]_I2ETH_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[2]_i2eth I2ETH Index of Screening Type 2 EtherType register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[2]_VLANE VLAN Enable **/
#define GMAC_GMAC_ST2RPQ[2]_VLANE		(1 << 8)

#define GMAC_GMAC_ST2RPQ[2]_VLANP_SHIFT		4
#define GMAC_GMAC_ST2RPQ[2]_VLANP_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[2]_vlanp VLANP VLAN Priority
@{*/
/**@}*/


#define GMAC_GMAC_ST2RPQ[2]_QNB_SHIFT		0
#define GMAC_GMAC_ST2RPQ[2]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[2]_qnb QNB Queue Number (0-5)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2rpq[3] GMACST2RPQ[3] Screening Type 2 Register Priority Queue
@{*/

/** GMAC_GMAC_ST2RPQ[3]_COMPCE Compare C Enable **/
#define GMAC_GMAC_ST2RPQ[3]_COMPCE		(1 << 30)

#define GMAC_GMAC_ST2RPQ[3]_COMPC_SHIFT		25
#define GMAC_GMAC_ST2RPQ[3]_COMPC_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[3]_compc COMPC Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[3]_COMPBE Compare B Enable **/
#define GMAC_GMAC_ST2RPQ[3]_COMPBE		(1 << 24)

#define GMAC_GMAC_ST2RPQ[3]_COMPB_SHIFT		19
#define GMAC_GMAC_ST2RPQ[3]_COMPB_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[3]_compb COMPB Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[3]_COMPAE Compare A Enable **/
#define GMAC_GMAC_ST2RPQ[3]_COMPAE		(1 << 18)

#define GMAC_GMAC_ST2RPQ[3]_COMPA_SHIFT		13
#define GMAC_GMAC_ST2RPQ[3]_COMPA_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[3]_compa COMPA Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[3]_ETHE EtherType Enable **/
#define GMAC_GMAC_ST2RPQ[3]_ETHE		(1 << 12)

#define GMAC_GMAC_ST2RPQ[3]_I2ETH_SHIFT		9
#define GMAC_GMAC_ST2RPQ[3]_I2ETH_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[3]_i2eth I2ETH Index of Screening Type 2 EtherType register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[3]_VLANE VLAN Enable **/
#define GMAC_GMAC_ST2RPQ[3]_VLANE		(1 << 8)

#define GMAC_GMAC_ST2RPQ[3]_VLANP_SHIFT		4
#define GMAC_GMAC_ST2RPQ[3]_VLANP_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[3]_vlanp VLANP VLAN Priority
@{*/
/**@}*/


#define GMAC_GMAC_ST2RPQ[3]_QNB_SHIFT		0
#define GMAC_GMAC_ST2RPQ[3]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[3]_qnb QNB Queue Number (0-5)
@{*/
/**@}*/


/**@}*/

