grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
/** @defgroup gmac_gmac_st2rpq[4] GMACST2RPQ[4] Screening Type 2 Register Priority Queue
@{*/

/** GMAC_GMAC_ST2RPQ[4]_COMPCE Compare C Enable **/
#define GMAC_GMAC_ST2RPQ[4]_COMPCE		(1 << 30)

#define GMAC_GMAC_ST2RPQ[4]_COMPC_SHIFT		25
#define GMAC_GMAC_ST2RPQ[4]_COMPC_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[4]_compc COMPC Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[4]_COMPBE Compare B Enable **/
#define GMAC_GMAC_ST2RPQ[4]_COMPBE		(1 << 24)

#define GMAC_GMAC_ST2RPQ[4]_COMPB_SHIFT		19
#define GMAC_GMAC_ST2RPQ[4]_COMPB_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[4]_compb COMPB Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[4]_COMPAE Compare A Enable **/
#define GMAC_GMAC_ST2RPQ[4]_COMPAE		(1 << 18)

#define GMAC_GMAC_ST2RPQ[4]_COMPA_SHIFT		13
#define GMAC_GMAC_ST2RPQ[4]_COMPA_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[4]_compa COMPA Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[4]_ETHE EtherType Enable **/
#define GMAC_GMAC_ST2RPQ[4]_ETHE		(1 << 12)

#define GMAC_GMAC_ST2RPQ[4]_I2ETH_SHIFT		9
#define GMAC_GMAC_ST2RPQ[4]_I2ETH_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[4]_i2eth I2ETH Index of Screening Type 2 EtherType register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[4]_VLANE VLAN Enable **/
#define GMAC_GMAC_ST2RPQ[4]_VLANE		(1 << 8)

#define GMAC_GMAC_ST2RPQ[4]_VLANP_SHIFT		4
#define GMAC_GMAC_ST2RPQ[4]_VLANP_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[4]_vlanp VLANP VLAN Priority
@{*/
/**@}*/


#define GMAC_GMAC_ST2RPQ[4]_QNB_SHIFT		0
#define GMAC_GMAC_ST2RPQ[4]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[4]_qnb QNB Queue Number (0-5)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2rpq[5] GMACST2RPQ[5] Screening Type 2 Register Priority Queue
@{*/

/** GMAC_GMAC_ST2RPQ[5]_COMPCE Compare C Enable **/
#define GMAC_GMAC_ST2RPQ[5]_COMPCE		(1 << 30)

#define GMAC_GMAC_ST2RPQ[5]_COMPC_SHIFT		25
#define GMAC_GMAC_ST2RPQ[5]_COMPC_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[5]_compc COMPC Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[5]_COMPBE Compare B Enable **/
#define GMAC_GMAC_ST2RPQ[5]_COMPBE		(1 << 24)

#define GMAC_GMAC_ST2RPQ[5]_COMPB_SHIFT		19
#define GMAC_GMAC_ST2RPQ[5]_COMPB_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[5]_compb COMPB Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[5]_COMPAE Compare A Enable **/
#define GMAC_GMAC_ST2RPQ[5]_COMPAE		(1 << 18)

#define GMAC_GMAC_ST2RPQ[5]_COMPA_SHIFT		13
#define GMAC_GMAC_ST2RPQ[5]_COMPA_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[5]_compa COMPA Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[5]_ETHE EtherType Enable **/
#define GMAC_GMAC_ST2RPQ[5]_ETHE		(1 << 12)

#define GMAC_GMAC_ST2RPQ[5]_I2ETH_SHIFT		9
#define GMAC_GMAC_ST2RPQ[5]_I2ETH_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[5]_i2eth I2ETH Index of Screening Type 2 EtherType register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[5]_VLANE VLAN Enable **/
#define GMAC_GMAC_ST2RPQ[5]_VLANE		(1 << 8)

#define GMAC_GMAC_ST2RPQ[5]_VLANP_SHIFT		4
#define GMAC_GMAC_ST2RPQ[5]_VLANP_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[5]_vlanp VLANP VLAN Priority
@{*/
/**@}*/


#define GMAC_GMAC_ST2RPQ[5]_QNB_SHIFT		0
#define GMAC_GMAC_ST2RPQ[5]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[5]_qnb QNB Queue Number (0-5)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2rpq[6] GMACST2RPQ[6] Screening Type 2 Register Priority Queue
@{*/

/** GMAC_GMAC_ST2RPQ[6]_COMPCE Compare C Enable **/
#define GMAC_GMAC_ST2RPQ[6]_COMPCE		(1 << 30)

#define GMAC_GMAC_ST2RPQ[6]_COMPC_SHIFT		25
#define GMAC_GMAC_ST2RPQ[6]_COMPC_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[6]_compc COMPC Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[6]_COMPBE Compare B Enable **/
#define GMAC_GMAC_ST2RPQ[6]_COMPBE		(1 << 24)

#define GMAC_GMAC_ST2RPQ[6]_COMPB_SHIFT		19
#define GMAC_GMAC_ST2RPQ[6]_COMPB_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[6]_compb COMPB Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[6]_COMPAE Compare A Enable **/
#define GMAC_GMAC_ST2RPQ[6]_COMPAE		(1 << 18)

#define GMAC_GMAC_ST2RPQ[6]_COMPA_SHIFT		13
#define GMAC_GMAC_ST2RPQ[6]_COMPA_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[6]_compa COMPA Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[6]_ETHE EtherType Enable **/
#define GMAC_GMAC_ST2RPQ[6]_ETHE		(1 << 12)

#define GMAC_GMAC_ST2RPQ[6]_I2ETH_SHIFT		9
#define GMAC_GMAC_ST2RPQ[6]_I2ETH_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[6]_i2eth I2ETH Index of Screening Type 2 EtherType register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[6]_VLANE VLAN Enable **/
#define GMAC_GMAC_ST2RPQ[6]_VLANE		(1 << 8)

#define GMAC_GMAC_ST2RPQ[6]_VLANP_SHIFT		4
#define GMAC_GMAC_ST2RPQ[6]_VLANP_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[6]_vlanp VLANP VLAN Priority
@{*/
/**@}*/


#define GMAC_GMAC_ST2RPQ[6]_QNB_SHIFT		0
#define GMAC_GMAC_ST2RPQ[6]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[6]_qnb QNB Queue Number (0-5)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2rpq[7] GMACST2RPQ[7] Screening Type 2 Register Priority Queue
@{*/

/** GMAC_GMAC_ST2RPQ[7]_COMPCE Compare C Enable **/
#define GMAC_GMAC_ST2RPQ[7]_COMPCE		(1 << 30)

#define GMAC_GMAC_ST2RPQ[7]_COMPC_SHIFT		25
#define GMAC_GMAC_ST2RPQ[7]_COMPC_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[7]_compc COMPC Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[7]_COMPBE Compare B Enable **/
#define GMAC_GMAC_ST2RPQ[7]_COMPBE		(1 << 24)

#define GMAC_GMAC_ST2RPQ[7]_COMPB_SHIFT		19
#define GMAC_GMAC_ST2RPQ[7]_COMPB_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[7]_compb COMPB Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[7]_COMPAE Compare A Enable **/
#define GMAC_GMAC_ST2RPQ[7]_COMPAE		(1 << 18)

#define GMAC_GMAC_ST2RPQ[7]_COMPA_SHIFT		13
#define GMAC_GMAC_ST2RPQ[7]_COMPA_MASK		0x1f
/** @defgroup gmac_gmac_st2rpq[7]_compa COMPA Index of Screening Type 2 Compare Word 0/Word 1 register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[7]_ETHE EtherType Enable **/
#define GMAC_GMAC_ST2RPQ[7]_ETHE		(1 << 12)

#define GMAC_GMAC_ST2RPQ[7]_I2ETH_SHIFT		9
#define GMAC_GMAC_ST2RPQ[7]_I2ETH_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[7]_i2eth I2ETH Index of Screening Type 2 EtherType register x
@{*/
/**@}*/

/** GMAC_GMAC_ST2RPQ[7]_VLANE VLAN Enable **/
#define GMAC_GMAC_ST2RPQ[7]_VLANE		(1 << 8)

