grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
#define GMAC_GMAC_ST2RPQ[7]_VLANP_SHIFT		4
#define GMAC_GMAC_ST2RPQ[7]_VLANP_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[7]_vlanp VLANP VLAN Priority
@{*/
/**@}*/


#define GMAC_GMAC_ST2RPQ[7]_QNB_SHIFT		0
#define GMAC_GMAC_ST2RPQ[7]_QNB_MASK		0x07
/** @defgroup gmac_gmac_st2rpq[7]_qnb QNB Queue Number (0-5)
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_ierpq[0] GMACIERPQ[0] Interrupt Enable Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_IERPQ[0]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IERPQ[0]_HRESP		(1 << 11)
/** GMAC_GMAC_IERPQ[0]_ROVR Receive Overrun **/
#define GMAC_GMAC_IERPQ[0]_ROVR		(1 << 10)
/** GMAC_GMAC_IERPQ[0]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IERPQ[0]_TCOMP		(1 << 7)
/** GMAC_GMAC_IERPQ[0]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IERPQ[0]_TFC		(1 << 6)
/** GMAC_GMAC_IERPQ[0]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IERPQ[0]_RLEX		(1 << 5)
/** GMAC_GMAC_IERPQ[0]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IERPQ[0]_RXUBR		(1 << 2)
/** GMAC_GMAC_IERPQ[0]_RCOMP Receive Complete **/
#define GMAC_GMAC_IERPQ[0]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_ierpq[1] GMACIERPQ[1] Interrupt Enable Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_IERPQ[1]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IERPQ[1]_HRESP		(1 << 11)
/** GMAC_GMAC_IERPQ[1]_ROVR Receive Overrun **/
#define GMAC_GMAC_IERPQ[1]_ROVR		(1 << 10)
/** GMAC_GMAC_IERPQ[1]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IERPQ[1]_TCOMP		(1 << 7)
/** GMAC_GMAC_IERPQ[1]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IERPQ[1]_TFC		(1 << 6)
/** GMAC_GMAC_IERPQ[1]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IERPQ[1]_RLEX		(1 << 5)
/** GMAC_GMAC_IERPQ[1]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IERPQ[1]_RXUBR		(1 << 2)
/** GMAC_GMAC_IERPQ[1]_RCOMP Receive Complete **/
#define GMAC_GMAC_IERPQ[1]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_ierpq[2] GMACIERPQ[2] Interrupt Enable Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_IERPQ[2]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IERPQ[2]_HRESP		(1 << 11)
/** GMAC_GMAC_IERPQ[2]_ROVR Receive Overrun **/
#define GMAC_GMAC_IERPQ[2]_ROVR		(1 << 10)
/** GMAC_GMAC_IERPQ[2]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IERPQ[2]_TCOMP		(1 << 7)
/** GMAC_GMAC_IERPQ[2]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IERPQ[2]_TFC		(1 << 6)
/** GMAC_GMAC_IERPQ[2]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IERPQ[2]_RLEX		(1 << 5)
/** GMAC_GMAC_IERPQ[2]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IERPQ[2]_RXUBR		(1 << 2)
/** GMAC_GMAC_IERPQ[2]_RCOMP Receive Complete **/
#define GMAC_GMAC_IERPQ[2]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_ierpq[3] GMACIERPQ[3] Interrupt Enable Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_IERPQ[3]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IERPQ[3]_HRESP		(1 << 11)
/** GMAC_GMAC_IERPQ[3]_ROVR Receive Overrun **/
#define GMAC_GMAC_IERPQ[3]_ROVR		(1 << 10)
/** GMAC_GMAC_IERPQ[3]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IERPQ[3]_TCOMP		(1 << 7)
/** GMAC_GMAC_IERPQ[3]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IERPQ[3]_TFC		(1 << 6)
/** GMAC_GMAC_IERPQ[3]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IERPQ[3]_RLEX		(1 << 5)
/** GMAC_GMAC_IERPQ[3]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IERPQ[3]_RXUBR		(1 << 2)
/** GMAC_GMAC_IERPQ[3]_RCOMP Receive Complete **/
#define GMAC_GMAC_IERPQ[3]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_ierpq[4] GMACIERPQ[4] Interrupt Enable Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_IERPQ[4]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IERPQ[4]_HRESP		(1 << 11)
/** GMAC_GMAC_IERPQ[4]_ROVR Receive Overrun **/
#define GMAC_GMAC_IERPQ[4]_ROVR		(1 << 10)
/** GMAC_GMAC_IERPQ[4]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IERPQ[4]_TCOMP		(1 << 7)
/** GMAC_GMAC_IERPQ[4]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IERPQ[4]_TFC		(1 << 6)
/** GMAC_GMAC_IERPQ[4]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IERPQ[4]_RLEX		(1 << 5)
/** GMAC_GMAC_IERPQ[4]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IERPQ[4]_RXUBR		(1 << 2)
/** GMAC_GMAC_IERPQ[4]_RCOMP Receive Complete **/
#define GMAC_GMAC_IERPQ[4]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_idrpq[0] GMACIDRPQ[0] Interrupt Disable Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_IDRPQ[0]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IDRPQ[0]_HRESP		(1 << 11)
/** GMAC_GMAC_IDRPQ[0]_ROVR Receive Overrun **/
#define GMAC_GMAC_IDRPQ[0]_ROVR		(1 << 10)
/** GMAC_GMAC_IDRPQ[0]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IDRPQ[0]_TCOMP		(1 << 7)
/** GMAC_GMAC_IDRPQ[0]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IDRPQ[0]_TFC		(1 << 6)
/** GMAC_GMAC_IDRPQ[0]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IDRPQ[0]_RLEX		(1 << 5)
/** GMAC_GMAC_IDRPQ[0]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IDRPQ[0]_RXUBR		(1 << 2)
/** GMAC_GMAC_IDRPQ[0]_RCOMP Receive Complete **/
#define GMAC_GMAC_IDRPQ[0]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_idrpq[1] GMACIDRPQ[1] Interrupt Disable Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_IDRPQ[1]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IDRPQ[1]_HRESP		(1 << 11)
/** GMAC_GMAC_IDRPQ[1]_ROVR Receive Overrun **/
#define GMAC_GMAC_IDRPQ[1]_ROVR		(1 << 10)
/** GMAC_GMAC_IDRPQ[1]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IDRPQ[1]_TCOMP		(1 << 7)
/** GMAC_GMAC_IDRPQ[1]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IDRPQ[1]_TFC		(1 << 6)
/** GMAC_GMAC_IDRPQ[1]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IDRPQ[1]_RLEX		(1 << 5)
/** GMAC_GMAC_IDRPQ[1]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IDRPQ[1]_RXUBR		(1 << 2)
/** GMAC_GMAC_IDRPQ[1]_RCOMP Receive Complete **/
#define GMAC_GMAC_IDRPQ[1]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_idrpq[2] GMACIDRPQ[2] Interrupt Disable Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_IDRPQ[2]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IDRPQ[2]_HRESP		(1 << 11)
/** GMAC_GMAC_IDRPQ[2]_ROVR Receive Overrun **/
#define GMAC_GMAC_IDRPQ[2]_ROVR		(1 << 10)
/** GMAC_GMAC_IDRPQ[2]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IDRPQ[2]_TCOMP		(1 << 7)
/** GMAC_GMAC_IDRPQ[2]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IDRPQ[2]_TFC		(1 << 6)
/** GMAC_GMAC_IDRPQ[2]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IDRPQ[2]_RLEX		(1 << 5)
/** GMAC_GMAC_IDRPQ[2]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IDRPQ[2]_RXUBR		(1 << 2)
/** GMAC_GMAC_IDRPQ[2]_RCOMP Receive Complete **/
#define GMAC_GMAC_IDRPQ[2]_RCOMP		(1 << 1)

/**@}*/

