grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
/** @defgroup gmac_gmac_idrpq[3] GMACIDRPQ[3] Interrupt Disable Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_IDRPQ[3]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IDRPQ[3]_HRESP		(1 << 11)
/** GMAC_GMAC_IDRPQ[3]_ROVR Receive Overrun **/
#define GMAC_GMAC_IDRPQ[3]_ROVR		(1 << 10)
/** GMAC_GMAC_IDRPQ[3]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IDRPQ[3]_TCOMP		(1 << 7)
/** GMAC_GMAC_IDRPQ[3]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IDRPQ[3]_TFC		(1 << 6)
/** GMAC_GMAC_IDRPQ[3]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IDRPQ[3]_RLEX		(1 << 5)
/** GMAC_GMAC_IDRPQ[3]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IDRPQ[3]_RXUBR		(1 << 2)
/** GMAC_GMAC_IDRPQ[3]_RCOMP Receive Complete **/
#define GMAC_GMAC_IDRPQ[3]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_idrpq[4] GMACIDRPQ[4] Interrupt Disable Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_IDRPQ[4]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IDRPQ[4]_HRESP		(1 << 11)
/** GMAC_GMAC_IDRPQ[4]_ROVR Receive Overrun **/
#define GMAC_GMAC_IDRPQ[4]_ROVR		(1 << 10)
/** GMAC_GMAC_IDRPQ[4]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IDRPQ[4]_TCOMP		(1 << 7)
/** GMAC_GMAC_IDRPQ[4]_TFC Transmit Frame Corruption Due to AHB Error **/
#define GMAC_GMAC_IDRPQ[4]_TFC		(1 << 6)
/** GMAC_GMAC_IDRPQ[4]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IDRPQ[4]_RLEX		(1 << 5)
/** GMAC_GMAC_IDRPQ[4]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IDRPQ[4]_RXUBR		(1 << 2)
/** GMAC_GMAC_IDRPQ[4]_RCOMP Receive Complete **/
#define GMAC_GMAC_IDRPQ[4]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_imrpq[0] GMACIMRPQ[0] Interrupt Mask Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_IMRPQ[0]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IMRPQ[0]_HRESP		(1 << 11)
/** GMAC_GMAC_IMRPQ[0]_ROVR Receive Overrun **/
#define GMAC_GMAC_IMRPQ[0]_ROVR		(1 << 10)
/** GMAC_GMAC_IMRPQ[0]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IMRPQ[0]_TCOMP		(1 << 7)
/** GMAC_GMAC_IMRPQ[0]_AHB AHB Error **/
#define GMAC_GMAC_IMRPQ[0]_AHB		(1 << 6)
/** GMAC_GMAC_IMRPQ[0]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IMRPQ[0]_RLEX		(1 << 5)
/** GMAC_GMAC_IMRPQ[0]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IMRPQ[0]_RXUBR		(1 << 2)
/** GMAC_GMAC_IMRPQ[0]_RCOMP Receive Complete **/
#define GMAC_GMAC_IMRPQ[0]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_imrpq[1] GMACIMRPQ[1] Interrupt Mask Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_IMRPQ[1]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IMRPQ[1]_HRESP		(1 << 11)
/** GMAC_GMAC_IMRPQ[1]_ROVR Receive Overrun **/
#define GMAC_GMAC_IMRPQ[1]_ROVR		(1 << 10)
/** GMAC_GMAC_IMRPQ[1]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IMRPQ[1]_TCOMP		(1 << 7)
/** GMAC_GMAC_IMRPQ[1]_AHB AHB Error **/
#define GMAC_GMAC_IMRPQ[1]_AHB		(1 << 6)
/** GMAC_GMAC_IMRPQ[1]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IMRPQ[1]_RLEX		(1 << 5)
/** GMAC_GMAC_IMRPQ[1]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IMRPQ[1]_RXUBR		(1 << 2)
/** GMAC_GMAC_IMRPQ[1]_RCOMP Receive Complete **/
#define GMAC_GMAC_IMRPQ[1]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_imrpq[2] GMACIMRPQ[2] Interrupt Mask Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_IMRPQ[2]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IMRPQ[2]_HRESP		(1 << 11)
/** GMAC_GMAC_IMRPQ[2]_ROVR Receive Overrun **/
#define GMAC_GMAC_IMRPQ[2]_ROVR		(1 << 10)
/** GMAC_GMAC_IMRPQ[2]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IMRPQ[2]_TCOMP		(1 << 7)
/** GMAC_GMAC_IMRPQ[2]_AHB AHB Error **/
#define GMAC_GMAC_IMRPQ[2]_AHB		(1 << 6)
/** GMAC_GMAC_IMRPQ[2]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IMRPQ[2]_RLEX		(1 << 5)
/** GMAC_GMAC_IMRPQ[2]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IMRPQ[2]_RXUBR		(1 << 2)
/** GMAC_GMAC_IMRPQ[2]_RCOMP Receive Complete **/
#define GMAC_GMAC_IMRPQ[2]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_imrpq[3] GMACIMRPQ[3] Interrupt Mask Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_IMRPQ[3]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IMRPQ[3]_HRESP		(1 << 11)
/** GMAC_GMAC_IMRPQ[3]_ROVR Receive Overrun **/
#define GMAC_GMAC_IMRPQ[3]_ROVR		(1 << 10)
/** GMAC_GMAC_IMRPQ[3]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IMRPQ[3]_TCOMP		(1 << 7)
/** GMAC_GMAC_IMRPQ[3]_AHB AHB Error **/
#define GMAC_GMAC_IMRPQ[3]_AHB		(1 << 6)
/** GMAC_GMAC_IMRPQ[3]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IMRPQ[3]_RLEX		(1 << 5)
/** GMAC_GMAC_IMRPQ[3]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IMRPQ[3]_RXUBR		(1 << 2)
/** GMAC_GMAC_IMRPQ[3]_RCOMP Receive Complete **/
#define GMAC_GMAC_IMRPQ[3]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_imrpq[4] GMACIMRPQ[4] Interrupt Mask Register Priority Queue (1..5)
@{*/

/** GMAC_GMAC_IMRPQ[4]_HRESP HRESP Not OK **/
#define GMAC_GMAC_IMRPQ[4]_HRESP		(1 << 11)
/** GMAC_GMAC_IMRPQ[4]_ROVR Receive Overrun **/
#define GMAC_GMAC_IMRPQ[4]_ROVR		(1 << 10)
/** GMAC_GMAC_IMRPQ[4]_TCOMP Transmit Complete **/
#define GMAC_GMAC_IMRPQ[4]_TCOMP		(1 << 7)
/** GMAC_GMAC_IMRPQ[4]_AHB AHB Error **/
#define GMAC_GMAC_IMRPQ[4]_AHB		(1 << 6)
/** GMAC_GMAC_IMRPQ[4]_RLEX Retry Limit Exceeded or Late Collision **/
#define GMAC_GMAC_IMRPQ[4]_RLEX		(1 << 5)
/** GMAC_GMAC_IMRPQ[4]_RXUBR RX Used Bit Read **/
#define GMAC_GMAC_IMRPQ[4]_RXUBR		(1 << 2)
/** GMAC_GMAC_IMRPQ[4]_RCOMP Receive Complete **/
#define GMAC_GMAC_IMRPQ[4]_RCOMP		(1 << 1)

/**@}*/

/** @defgroup gmac_gmac_st2er[0] GMACST2ER[0] Screening Type 2 Ethertype Register
@{*/


#define GMAC_GMAC_ST2ER[0]_COMPVAL_SHIFT		0
#define GMAC_GMAC_ST2ER[0]_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2er[0]_compval COMPVAL Ethertype Compare Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2er[1] GMACST2ER[1] Screening Type 2 Ethertype Register
@{*/


#define GMAC_GMAC_ST2ER[1]_COMPVAL_SHIFT		0
#define GMAC_GMAC_ST2ER[1]_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2er[1]_compval COMPVAL Ethertype Compare Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2er[2] GMACST2ER[2] Screening Type 2 Ethertype Register
@{*/


