grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
#define GMAC_GMAC_ST2ER[2]_COMPVAL_SHIFT		0
#define GMAC_GMAC_ST2ER[2]_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2er[2]_compval COMPVAL Ethertype Compare Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2er[3] GMACST2ER[3] Screening Type 2 Ethertype Register
@{*/


#define GMAC_GMAC_ST2ER[3]_COMPVAL_SHIFT		0
#define GMAC_GMAC_ST2ER[3]_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2er[3]_compval COMPVAL Ethertype Compare Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[0]_gmac_st2cw0 GMACST2CW[0]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[0]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[0]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[0]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[0]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[0]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[0]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[0]_gmac_st2cw1 GMACST2CW[0]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[0]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[0]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[0]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[0]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[0]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[0]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[1]_gmac_st2cw0 GMACST2CW[1]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[1]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[1]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[1]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[1]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[1]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[1]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[1]_gmac_st2cw1 GMACST2CW[1]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[1]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[1]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[1]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[1]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[1]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[1]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[2]_gmac_st2cw0 GMACST2CW[2]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[2]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[2]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[2]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[2]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[2]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[2]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[2]_gmac_st2cw1 GMACST2CW[2]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[2]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[2]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[2]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[2]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[2]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[2]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[3]_gmac_st2cw0 GMACST2CW[3]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[3]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[3]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[3]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[3]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[3]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[3]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[3]_gmac_st2cw1 GMACST2CW[3]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[3]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[3]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[3]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[3]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[3]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[3]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[4]_gmac_st2cw0 GMACST2CW[4]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[4]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[4]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[4]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[4]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[4]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[4]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[4]_gmac_st2cw1 GMACST2CW[4]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[4]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[4]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[4]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[4]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[4]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[4]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[5]_gmac_st2cw0 GMACST2CW[5]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[5]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[5]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[5]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[5]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[5]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[5]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

