grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
/** @defgroup gmac_gmac_st2cw[5]_gmac_st2cw1 GMACST2CW[5]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[5]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[5]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[5]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[5]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[5]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[5]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[6]_gmac_st2cw0 GMACST2CW[6]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[6]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[6]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[6]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[6]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[6]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[6]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[6]_gmac_st2cw1 GMACST2CW[6]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[6]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[6]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[6]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[6]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[6]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[6]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[7]_gmac_st2cw0 GMACST2CW[7]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[7]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[7]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[7]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[7]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[7]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[7]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[7]_gmac_st2cw1 GMACST2CW[7]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[7]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[7]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[7]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[7]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[7]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[7]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[8]_gmac_st2cw0 GMACST2CW[8]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[8]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[8]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[8]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[8]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[8]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[8]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[8]_gmac_st2cw1 GMACST2CW[8]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[8]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[8]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[8]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[8]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[8]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[8]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[9]_gmac_st2cw0 GMACST2CW[9]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[9]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[9]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[9]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[9]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[9]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[9]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[9]_gmac_st2cw1 GMACST2CW[9]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[9]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[9]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[9]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[9]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[9]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[9]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[10]_gmac_st2cw0 GMACST2CW[10]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[10]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[10]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[10]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[10]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[10]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[10]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[10]_gmac_st2cw1 GMACST2CW[10]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[10]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[10]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[10]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[10]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[10]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[10]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[11]_gmac_st2cw0 GMACST2CW[11]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


