grevaillot/svd_tools/headers/ATSAMV71N21B/gmac.h
#define GMAC_GMAC_ST2CW[17]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[17]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[17]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[17]_gmac_st2cw1 GMACST2CW[17]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[17]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[17]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[17]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[17]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[17]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[17]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[18]_gmac_st2cw0 GMACST2CW[18]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[18]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[18]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[18]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[18]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[18]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[18]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[18]_gmac_st2cw1 GMACST2CW[18]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[18]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[18]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[18]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[18]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[18]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[18]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[19]_gmac_st2cw0 GMACST2CW[19]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[19]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[19]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[19]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[19]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[19]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[19]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[19]_gmac_st2cw1 GMACST2CW[19]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[19]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[19]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[19]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[19]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[19]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[19]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[20]_gmac_st2cw0 GMACST2CW[20]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[20]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[20]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[20]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[20]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[20]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[20]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[20]_gmac_st2cw1 GMACST2CW[20]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[20]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[20]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[20]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[20]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[20]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[20]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[21]_gmac_st2cw0 GMACST2CW[21]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[21]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[21]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[21]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[21]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[21]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[21]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[21]_gmac_st2cw1 GMACST2CW[21]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[21]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[21]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[21]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[21]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[21]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[21]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[22]_gmac_st2cw0 GMACST2CW[22]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[22]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[22]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[22]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[22]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[22]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[22]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[22]_gmac_st2cw1 GMACST2CW[22]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[22]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[22]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[22]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[22]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[22]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[22]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[23]_gmac_st2cw0 GMACST2CW[23]GMACST2CW0 Screening Type 2 Compare Word 0 Register
@{*/


#define GMAC_GMAC_ST2CW[23]_GMAC_ST2CW0_COMPVAL_SHIFT		16
#define GMAC_GMAC_ST2CW[23]_GMAC_ST2CW0_COMPVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[23]_gmac_st2cw0_compval COMPVAL Compare Value
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[23]_GMAC_ST2CW0_MASKVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[23]_GMAC_ST2CW0_MASKVAL_MASK		0xffff
/** @defgroup gmac_gmac_st2cw[23]_gmac_st2cw0_maskval MASKVAL Mask Value
@{*/
/**@}*/


/**@}*/

/** @defgroup gmac_gmac_st2cw[23]_gmac_st2cw1 GMACST2CW[23]GMACST2CW1 Screening Type 2 Compare Word 1 Register
@{*/


#define GMAC_GMAC_ST2CW[23]_GMAC_ST2CW1_OFFSSTRT_SHIFT		7
#define GMAC_GMAC_ST2CW[23]_GMAC_ST2CW1_OFFSSTRT_MASK		0x03
/** @defgroup gmac_gmac_st2cw[23]_gmac_st2cw1_offsstrt OFFSSTRT Ethernet Frame Offset Start
@{*/
/**@}*/


#define GMAC_GMAC_ST2CW[23]_GMAC_ST2CW1_OFFSVAL_SHIFT		0
#define GMAC_GMAC_ST2CW[23]_GMAC_ST2CW1_OFFSVAL_MASK		0x7f
/** @defgroup gmac_gmac_st2cw[23]_gmac_st2cw1_offsval OFFSVAL Offset Value in Bytes
@{*/
/**@}*/


/**@}*/
